{"Wings Out": ["Food Delivery ServicesChicken WingsEdgeley", "Delivery", "5 star rating"], "2. Mary Be Kitchen": ["Canadian (New)$$Yonge and St. Clair", "Closed until 9:00 AM", "“What a lovely place! Came here for brunch with my friends, and I absolutely adored it. The service is quick, the food is very affordable, and delicious! I…” more", "Delivery", "Takeout", "4.5 star rating"], "3. STACK": ["Barbeque$$", "Closed until Noon", "“Dope place for some good bbq. The waitresses were friendly and gave us some good insight on some drinks to enjoy with our food. I got a big platter, gotta…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "4. Positano Restaurant": ["PizzaItalian$$Mount Pleasant and Davisville", "Closed until 11:30 AM", "“Excellent Service, Excellent Food Couldn't be more impressed. Greeted at the door by the owner. Seated near the window as I requested. Had a young Italian…” more", "4 star rating"], "5. Megumi Mazesoba": ["JapaneseDeer Park", "Closed until 11:30 AM", "Opened 2 months ago", "“Amazing!!! Really really great food and nice vibes. Highly recommend for a unique dining experience.” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "6. Baretto Caffe": ["CafesItalian$$", "Closed today", "“Absolutely delicious! Highly recommend this place if you're looking for a solid breakfast .I thought this place was great, I love the look and feel of this…” more", "5 star rating"], "7. La Latina": ["MexicanLatin AmericanSteakhousesYonge and Eglinton", "Closed until 5:00 PM", "“La Latina Came here to celebrate a girlfriends birthday during the weekday and instantly fell in love with the aesthetic's and vibe.. vibrant neon lights/…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "8. KINKA IZAKAYA ORIGINAL": ["JapanesePubs$$Downtown Core", "Closed until 5:00 PM", "“Came on a weekday night over the holidays, before a Raptors game. The restaurant is a 3 minute walk from Scotiabank - very close. Excellent meal! The rundown…” more", "Outdoor seating", "Delivery", "Takeout", "Find a Table", "4 star rating"], "9. Liu": ["DessertsTurkishCoffee & TeaLittle Italy", "Closed until 7:00 AM", "Opened 3 months ago", "“Dropped in with my wife. The desert was wonderful and had an interesting discussion with the proprietor. What more could you want.” more", "4.5 star rating"], "10. Pai Northern Thai Kitchen": ["ThaiYonge and Eglinton", "Closed until Noon", "“Whoa, this is one of the better Thai establishments I've been to in a long time. Which says a lot, since there's so many good Thai restaurants. The food is a…” more", "Delivery", "Takeout", "4 star rating"], "12. Byblos Uptown": ["MediterraneanYonge and Eglinton", "Closed until 5:00 PM", "“I loved the ambience at the restaurant and the food, which was a bit pricy. However, I would try the restaurant again with my friends next time for sure for…” more", "3.5 star rating"], "13. Mayrik": ["MediterraneanMiddle Eastern$$$Mount Pleasant and Davisville", "Closed until 11:00 AM", "Healthy dining", "Vegan friendly", "“I've been here twice. It's very good Armenian cuisine that's done in a fine dining manner. The octopus was outstanding and cooked perfectly. Roasted vegetables…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "14. Pai Northern Thai Kitchen": ["Thai$$Entertainment District", "Closed until Noon", "“Good food Great ambient The crew are so nice Will back to try the other menus for sure!” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "15. Balsamico Ristorante": ["Italian$$Mount Pleasant and Davisville", "Closed until 5:00 PM", "“A nice, cozy Italian restaurant. It's a small venue so the attentiveness of our server was \"just right\". The food was delicious. Good size portions. Sorry…” more", "Delivery", "4.5 star rating"], "16. Seven Lives Tacos y Mariscos": ["Mexican$Kensington Market", "Closed until Noon", "“One of the best taco spots in downtown. This place is in Kensington market and it's always got a lineup but that lives very quickly. There's not too much…” more", "Delivery", "Takeout", "4.5 star rating"], "17. Sophie’s": ["Breakfast & Brunch$$Mount Pleasant and Davisville", "Closed until 8:00 AM", "Waitlist opens at 8:00 am", "“A small place for breakfast and brunch. Pretty busy and can be line up for 30 to 45mins. But it's worth to wait. Fresh ingredients and cooked just right. I…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "18. Playa Cabana Taqueria": ["MexicanYonge and St. Clair", "“The tacos from this place are simply delicious! The food quality is amazing and everything is well prepared, packaged and served. The staff is super friendly…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "19. Lao Lao Bar": ["LaotianDowntown Core", "Closed until 4:30 PM", "Opened a few days ago", "“This Laotian restaurant from the team from Sabai Sabai recently opened. I went on a Monday night and they're already packed! Luckily they take reservations and…” more", "3.5 star rating"], "20. Grazie Ristorante": ["Italian$$Yonge and Eglinton", "Closed until Noon", "“Great place for Italian food, great service and the ambience is a little crowded for what I wanted for the day (a romantic dinner)... but definitely I will…” more", "Delivery", "Takeout", "4 star rating"], "22. Yuzuki": ["Japanese", "Closed until 11:30 AM", "“My favourite non-omakase sushi in the city. Visit Yuzuki for an authentic Japanese experience with excellent sushi, seasonal dishes and great service. The sake…” more", "4.5 star rating"]}