{"1. Wingstop": ["Chicken WingsGreektown", "Open until Midnight", "“Wingstop is a USA chain. This Danforth location is their third in Canada (all 3 are currently in Toronto). They do plan to expand across Canada. The soft opening was 2022-11-17 and…” more", "4 star rating"], "2. Isaan Der - Thai Kitchen & Bar": ["ThaiSoupNoodles", "Open until 10:00 PM", "Opened 6 weeks ago", "“Average sized restaurant with good amount of comfortable seating, and very modern cool looking decor. Felt clean and spacious. Service was good, the wait…” more", "4.5 star rating"], "3. NextDoor Restaurant": ["Canadian (New)BarsTapas/Small Plates$$Unionville Mainstreet", "Open until Midnight", "“First time to come to this restaurant. The vibe is great and the menu is so different to normal brunch. We have brunch tower with Lamb sausage, scramble eggs,…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "4. The North Japanese Noodle Bar": ["JapaneseNoodlesUnionville", "Open until 9:00 PM", "“Location/Service This place is right in the Langham plaza - tucked in the corner of the second floor where Meet Fresh and Garden HK Cafe area. There are plenty…” more", "4 star rating"], "5. Tai Ping Sha Cai": ["ChineseNoodles", "Open until 8:00 PM", "Opened 8 weeks ago", "“A famous Guangzhou noodle chain that has been around since 1943. They are famous for their beef brisket noodle, and now relocated to a new location at Warden /…” more", "4 star rating"], "6. Cafe Mozaiko": ["JapaneseSushi BarsComfort Food$$", "Closes in 38 min", "Locally owned & operated", "Established in 2021", "“Absolutely love this spot! So delicious! The restaurant is along the shops at Markham Cathedral town, parking is on the sides of the streets. Was quite busy…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "7. Mikaku Udon Bar": ["SeafoodAsian FusionBars$$", "Open until 9:00 PM", "“Ever since I found out about Mikaku Udon Bar, I've been coming here ever since! This is often my favourite spot to meet up with friends for dinner, or to…” more", "4 star rating"], "8. Cafe De Hong Kong": ["Hong Kong Style Cafe$$Brown's Corners", "Closes in 8 min", "Waitlist opens at 10:00 am", "“Great HK style food. With modern cuisine alterations. Friendly services, reasonable price. Highly recommended.” more", "Outdoor seating", "Takeout", "4 star rating"], "9. Daimaru Sukiyaki": ["Hot PotJapaneseChineseMilliken", "Open until Midnight", "Discounts available", "Free parking", "Waitlist is closed", "“Plenty of servings and the crew is attentive on assisting. I would suggest this place if your looking to eat something warm during this cold winter season.” more", "Outdoor seating", "Takeout", "4.5 star rating"], "10. Ushi Shabu Shabu": ["Hot Pot$$$", "Open until Midnight", "“Ordered the lunch special for $15.75 and it comes with 2 kinds of meat, noodles, veggies and a mini dessert. Big portions and the coconut milk broth was very…” more", "Outdoor seating", "4.5 star rating"], "12. Bueokae Korean Restaurant - Love’s Kitchen": ["Korean$$", "Open until 10:30 PM", "“Been coming here since almost the beginning now and it's always so consistent and delicious. Happy to see it get even popular! Nothing new to say compared to…” more", "Outdoor seating", "Takeout", "4.5 star rating"], "13. Azyun Restaurant": ["ChineseTapas Bars$$Unionville", "Open until 9:00 PM", "“It's really a gem at Main street Markham Road ! I would say the chef is talented in playing sweetness and spicy things, unlike those focus on heavy hot spicy…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "14. Inspire Restaurant": ["Asian FusionBurgers$$Unionville", "Open until 8:30 PM", "“This very cute neighborhood joint has a small but focused menu with well prepared, innovative, plentiful and tasty food.” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "15. Cafe le Majestik": ["Hong Kong Style CafeScarborough", "Open until 8:00 PM", "“We've had a few friends tell us about this so I knew exactly where I wanted to go since we were sans kids for the morning! A bit of a trek for us east enders…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "16. Jeon Ju Hyang": ["KoreanNoodlesUnionville", "Open until 9:30 PM", "“Been to the bamburgh circle location and had no clue this was the same restaurant but much closer too my house. Came around 9pm and they were super…” more", "4 star rating"], "17. Chiang Rai Thai Kitchen and Bar": ["ThaiAsian FusionCocktail Bars$$Milliken", "Open until 10:00 PM", "“On a Friday night, we waited patiently over a hour for a table for 3...luckily we had a great experience so it was worth the wait! Be sure to make reservations…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "18. Big Beef Bowl Hand-Pulled Noodle": ["NoodlesChineseBarbeque$$Unionville", "Open until 11:00 PM", "“One of my favourite spots in Markham for hand pulled noodles - Big Beef Noodle is a family owned restaurant that I highly recommend. Even when its hot or cold,…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "19. Alchemy": ["Breakfast & BrunchCoffee & Tea$$", "Closed until 8:00 AM tomorrow", "Waitlist opens at 8:00 am", "Opened 3 months ago", "“A rather busy brunch restaurant with pretty barn decor and amazing food. The restaurant uses yelp waitlist so get on the list and grab a coffee at Mcd, Timmies…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "20. Cha Kee": ["Hong Kong Style Cafe", "Closes in 5 min", "“Quick and easy afternoon tea here at Cha Kee in Markham. Don't need to say much coz it is quite a well known HK style cafe in the area. French Toast, very…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "22. Jin Korean Noodles": ["KoreanDumplingsNoodles$$", "Open until 9:00 PM", "“The good: Oh what a gem this place is! The good food, prices and the satisfied feeling you leave when you're contently full. First off, the kimchi they serve…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "23. Good Catch Cafe": ["Hong Kong Style Cafe$$Unionville", "Open until 8:00 PM", "“Was extremely hungry after going on a fishing trip. I heard good things about this Hong Kong cafe and boil/ bar. It was packed but conveniently they have a…” more", "Outdoor seating", "4 star rating"], "24. Fujisan Japanese Restaurant": ["JapaneseSushi BarsUnionville", "Open until 10:00 PM", "“This newly sushi resto is now opened in Markham Main Street. Parking is available on the street and parking lot on the side and back. We tried the lunch…” more", "5 star rating"], "25. Good So Good Chinese Restaurant": ["Chinese", "Opened 5 weeks ago", "“Recently reopened... They use to be at hwy7 and Bayview, now moved north to Elgin Mills. This new location is a lot more spacious and of course begin new,…” more", "3.5 star rating"], "26. Linh Anh Vietnamese Cuisine": ["VietnameseNoodles$$Milliken", "Open until 11:00 PM", "“The place has an interesting set up. You put your name on a list yourself and as a table opens they will call you up. The service also is a bit different, your…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "27. Ryu Izakaya": ["JapaneseTapas/Small PlatesCocktail Bars", "Open until Midnight", "“Super cool ambience with a DJ! Great, tasty food and a nice selection of drinks. Really enjoyable time with friends! Don't go hungry! Food is good but more…” more", "4 star rating"], "28. Draco Markham": ["Canadian (New)Asian FusionCocktail Bars$$Unionville", "Open until 10:00 PM", "“I really like this place. The food is good, the wait staff on point. It also looks terrific and is very comfortable. Location: It's located off the lobby in…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "29. Fortune Villa": ["Chinese", "“Soft Opening Take Out Review (March 2023) 15% off promotion Under Casa Deluz Group Good quality BBQ, not much interior design change. Full house for soft…” more", "4 star rating"], "30. Toyosu Markham": ["Sushi Bars$$Unionville", "Open until 8:00 PM", "“High quality takeout sushi. They have good quality sashimi which was super fresh. Platter was also good with a variety of different sashimi, sushi, and rolls.…” more", "Delivery", "Takeout", "4 star rating"], "32. The Noodle Bar": ["Noodles$$Brown's Corners", "Closed until 11:00 AM tomorrow", "“Location/Service This place is located in the commercial Highway 7/Warden plaza with the HSBC, dental and a few bubble tea places. Parking is available all…” more", "Outdoor seating", "4 star rating"], "33. Yabu Shabu": ["Asian FusionJapaneseMilliken", "Open until 11:00 PM", "“Hands down to one of the best Asian fusion mini-pot and Japanese style food place Yabu Shabu. The place really understands that hot pot culture is not only for…” more", "Delivery", "Takeout", "4 star rating"], "34. Sung Won": ["KoreanUnionville", "“(4.5/5) If Korean cuisine is your comfort food, then I'd highly recommend trying Sung Won to cater to your hunger. I've been ordering from this restaurant for…” more", "Delivery", "Takeout", "4.5 star rating"], "35. Cafe le Majestik": ["Hong Kong Style CafeScarborough", "Closes in 58 min", "“We've had a few friends tell us about this so I knew exactly where I wanted to go since we were sans kids for the morning! A bit of a trek for us east enders…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "36. Shizuku": ["Sushi BarsJapaneseMilliken", "Open until 10:30 PM", "“We booked the entire place to ourselves and it was quite a fantastic and intimate dining experience. We were initially a group of 8 but were allowed to add…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "37. Komeya Cafe": ["JapaneseCoffee & Tea$$", "Closes in 28 min", "“On Family Day, I decided to break out of the house and take a drive around the eastern part of Markham. While parked in front of Panash Bakery, I did a quick…” more", "Takeout", "4 star rating"], "38. bb.q Chicken": ["KoreanChicken ShopUnionville", "Open until 11:00 PM", "“BB.Q Chicken is a hidden gem in Downtown Markham, and it's worth the effort to find a parking spot and walk a minute or so to get there. I found it easier to…” more", "4.5 star rating"], "39. Hoolala Chicken": ["KoreanBarbeque", "Open until 11:00 PM", "“The good: I got take out and hoo la la, it was yummy! I ordered the Korean fried chicken so I have yet to try their famous barbecue chicken in person. I…” more", "4.5 star rating"], "40. Peter’s Fine Dining": ["SeafoodSteakhouses$$$Unionville", "Open until 10:00 PM", "“I'm a steak snob. I travel around the world eating steaks. This place is very solid and will be a part of my Toronto rotation. Had the oysters rockerfeller…” more", "Takeout", "4 star rating"], "42. PaPa Chang’s": ["Taiwanese$", "Open until 10:00 PM", "“It's a tiny Taiwanese resto at Markham Road and 16th Ave. BBQ chicken sesame flat bread: Chicken was cooked nicely. Flatbread could've been lighter (it was…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "43. Ai Taiker Taiwanese Fried Chicken": ["Chicken ShopFast Food", "“Fried foods all day, everydayyyy I haven't had this much fried foods in one sitting but it was definitely worth it! Fried foods is normally associated with…” more", "4 star rating"], "44. Good Catch Cafe": ["Hong Kong Style Cafe$$Unionville", "Closes in 55 min", "“Was extremely hungry after going on a fishing trip. I heard good things about this Hong Kong cafe and boil/ bar. It was packed but conveniently they have a…” more", "Outdoor seating", "4 star rating"], "45. Il Postino": ["Italian$$$Unionville Mainstreet", "Open until 10:00 PM", "“Took my gf here for a belated valentine's day dinner recently. Made a reservation a month in advance for 7pm on OpenTable with no issues. Super smooth.…” more", "Outdoor seating", "Takeout", "4 star rating"], "46. Midori Ramen": ["Ramen", "Open until 11:00 PM", "Opened 3 months ago", "“Dined at the one in Scarborough. Glad that they opened another restaurant in Richmond Hill, closer to where I live. I was greeted warmly as I stepped into the…” more", "4 star rating"], "47. 100 Percent Korean": ["Korean$Milliken", "Open until 9:00 PM", "“Was very sad to learn that the owner had passed away (in his 90s, long life). His daughter is running things and her father would be proud. The standards have…” more", "Outdoor seating", "Takeout", "4.5 star rating"], "48. Zen Sanuki Udon": ["JapaneseSoupNoodles$$Milliken", "Open until 10:00 PM", "“My favorite udon restaurant! Own by Japanese, how can you go wrong with that! Service is always good too. They are always busy, but the restaurant has quite…” more", "Outdoor seating", "Delivery", "Takeout", "Find a Table", "4 star rating"], "49. Lee Bu Guan": ["ChineseMilliken", "Open until Midnight", "“Pros: Very delicated and tasty barbecue. Love the way they serve the food and the variety of food they have. Definitely worth a try here! Cons: slightly…” more", "4 star rating"], "50. J San Sushi & Market": ["JapaneseSushi Bars", "Open until 9:00 PM", "“The good: A new, beautiful and modern restaurant/shop. I ordered takeout and the presentation was stunning. It was packaged in a nice wooden box, and…” more", "4.5 star rating"], "52. Poong Moon": ["Asian FusionKoreanNoodles", "Open until 1:00 AM", "“Hidden gem near Steels and Yonge Minimal menu items to choose from, but if you looking for a place to drink, fried snacks, and a handful of main noodle dish.…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "53. Toyosu Markham": ["Sushi Bars$$Unionville", "Closes in 51 min", "“High quality takeout sushi. They have good quality sashimi which was super fresh. Platter was also good with a variety of different sashimi, sushi, and rolls.…” more", "Delivery", "Takeout", "4 star rating"], "54. Chillax Coffee": ["Coffee & TeaBreakfast & BrunchJuice Bars & Smoothies$$", "Closed until 9:00 AM tomorrow", "Waitlist opens at 9:00 am", "“Made it to the top of our favourite brunch list. The handcrafted coffees smelled so good and the best part for me is that it's not too sweet, perfect for the…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "55. Fat Ninja Bite": ["JapaneseBurgersKorean$$Milliken", "Open until 9:45 PM", "“Great food and huge portions at good prices. They do one thing (Katsu) and do it extremely well!” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "56. Nam 2": ["Vietnamese$$Unionville", "Open until 9:00 PM", "Live wait time: 35 - 50 mins", "“Fantastic food, quick service, prepared right every time. I have had a little of everything on the menu but I have to vouch for their dry wings, can't help but…” more", "Outdoor seating", "Takeout", "Join the Waitlist", "3.5 star rating"], "57. Good Luck Hongkong Cafe": ["Hong Kong Style Cafe$$Willowdale", "Open until 11:00 PM", "“Their bake rice comes with a hot beverage of your choice. The portions are typical, as they use the standardized bowl that most Hk cafes use for baked…” more", "4 star rating"], "58. Chat Bar": ["BarsBarbequeChinese$$Unionville Mainstreet", "Open until 2:00 AM", "“Amazing food for a midnight snack! Came here on a late Friday night with a few friends and our tummy was satisfied. We ordered a bunch of skewers (lamb,…” more", "Outdoor seating", "4 star rating"], "59. Big Bone BBQ & Wicked Wings": ["BarbequeChicken Wings$$Unionville", "Open until 8:30 PM", "“I've been waiting to try this place for sometime, but never got around to it. We went on a Monday night and was luckily ahead of the dine-in crowd. We ordered…” more", "4 star rating"], "60. Silo Grill": ["Canadian (New)", "Open until 9:00 PM", "“Silo Grill easily became a fan favourite for my family. We visited at least a dozen time throughout the Summer. We enjoyed each visit so much, we returned with…” more", "Takeout", "4 star rating"], "62. Mr ChiMaek": ["Korean$$Milliken", "Open until 9:30 PM", "“After having a bad experience previously from a nearby establishment it was time to give mr chimaek a go. I called in to place my takeaway order, wait was a…” more", "Outdoor seating", "Takeout", "4 star rating"], "63. Katsuya": ["Asian FusionJapanese$$Brown's Corners", "Open until 11:00 PM", "“Food is always good! The server Paul was really good and attentive! Great experience as always.” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "64. Good Catch Boil House": ["Cajun/CreoleSeafoodAsian Fusion$$Unionville", "Open until Midnight", "“So apparently this resto is called Good Catch Bar & Cafe now? Interesting. It seems that they've kept the boil house menu and still use fresh seafood but…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "65. Osaka Sushi Japanese Korean Restaurant": ["JapaneseKoreanSushi Bars$$Unionville", "Open until 10:30 PM", "“Went to kick-off my husband's birthday weekend in September. We decided to check this place out because of all the great reviews. We tried a lot of different…” more", "Delivery", "Takeout", "4 star rating"], "66. Hana Don": ["JapaneseSeafood", "Open until 11:00 PM", "Locally owned & operated", "Discounts available", "“Arrived here on the coldest winter night of the year. It wasn't too busy but the atmosphere was nice. Staff are super friendly and accommodating. We got the…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "67. The King’s Landing": ["Chicken WingsCanadian (New)Burgers$$", "Open until 1:00 AM", "“Seoul poutine was full of flavour Seoul burger was good but same sauce as poutine Juicy patties in both seoul burger and spicy burger” more", "Outdoor seating", "4.5 star rating"], "68. KoSam": ["Korean$$", "Open until 10:00 PM", "“I really wanted to give this restaurant a higher rating as I was super excited to try the samgyetang. The price was pretty steep. But I was still eager to…” more", "4 star rating"], "69. The Thandur": ["IndianGreensborough", "Open until 10:00 PM", "“Found this cozy, quaint resto on Yelp near my gf's place. I followed google maps and pulled into what I thought was a random office/corporate building lot. I…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "70. Frilu Restaurant": ["Canadian (New)$$$$Thornhill", "Open until 9:30 PM", "“I recently had the privilege of dining at Frilu and I have to say, it was a truly unforgettable experience. From the moment I stepped into the restaurant, I…” more", "4.5 star rating"], "72. Dudu Fish House": ["ChineseSoupMilliken", "“I came to this restaurant for a social media event and I honestly otherwise I wouldn't have come but I'm so glad I did. Their ordering method is base of…” more", "4.5 star rating"], "73. Old Country Inn Restaurant": ["Austrian$$Unionville Mainstreet", "Open until 9:00 PM", "“We visited here again during the Christmas season and I'm happy Old Country Inn was able to keep up with the quality of their Schnitzels and jumbo shrimp dish!…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "74. Doner King": ["DonairsTurkishPoutineries$Scarborough", "Open until 10:00 PM", "“Located in the middlefield and steeles plaza -- amongst the other hidden gems, this is one that cannot be missed! I discovered them around 2020 and it has…” more", "4.5 star rating"], "75. Kakushin": ["JapaneseSushi BarsPoke", "Open until 9:00 PM", "“Ordered the 504 was super fresh and delicious. The torched trio Rice was so good with a little kick. Definitely will come back and try the rest of the meal.” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "76. The Pho Restaurant": ["VietnameseNoodlesSoup$$Brown's Corners", "Open until 10:00 PM", "Live wait time: 16 - 31 mins", "“I had a serious craving for Pho and it's been quite a while that I've had some good pho! My brother took me here and The Pho Restaurant did not disappoint!!…” more", "Outdoor seating", "Delivery", "Takeout", "Join the Waitlist", "4 star rating"], "77. Pho Metro": ["VietnameseComfort FoodNoodles$$", "Open until 8:30 PM", "“Pho Metro is by far the best place to get Vietnamese food in Markham! When you first walk in it looks like your average restaurant but when I say the food is…” more", "Delivery", "Takeout", "4 star rating"], "78. Chris Jerk Caribbean Bistro": ["Caribbean$$Scarborough", "Open until 9:00 PM", "“Call ahead to avoid wait. I don't often give in 5 stars but Chris Jerk deserve it! Where do I begin? Their coconut rice just everything! The oxtail stew…” more", "Takeout", "4.5 star rating"], "79. Mr. Congee Chinese Cuisine": ["ChineseSeafoodNoodlesUnionville", "Open until 10:00 PM", "“Looks like they opened up a 2nd location here in Markham. Original one is still in Richmond Hill! Lots of space inside and super new. Most importantly, very…” more", "3.5 star rating"], "80. Saemaeul Sikdang": ["KoreanLangstaff", "Open until Midnight", "Waitlist is closed", "“Good place to eat, cute vibes. Great for a date! Easy to find and lots of parking available.” more", "Find a Table", "4 star rating"], "82. Eggtart Queen": ["DessertsBakeriesChinese$Unionville", "Open until 9:00 PM", "“There's a lot packed into this shop! The most selection that I've ever seen in egg tarts and mochis! Tried the durian egg tart which had a good amount of…” more", "3 star rating"], "83. Poke Guys": ["PokeHawaiian$$Unionville", "Open until 9:00 PM", "“Big portions, friendly staff. One of my go to pokè places in Markham. They're doing a promotion right now where if you spend $20 or more you get a lucky…” more", "Delivery", "Takeout", "4 star rating"], "84. West Gate Classic Canton Eatery": ["CantoneseUnionville", "“Must order Pan Fried Pork Buns!! (5 stars) Has been a repeat order for me. Picky eaters at the table would speak and ask for more. Also tried their preserved…” more", "4.5 star rating"], "85. Sunplus Asian Kitchen": ["ChineseBarbeque", "“Needed something to eat and finally decided to give this place a try. With a few other restaurants close by this would have never been on my list until I saw…” more", "Takeout", "4.5 star rating"], "86. Toshi Ryoriten": ["Japanese$$$", "Open until 10:00 PM", "“This is my second time at Toshi Ryoriten celebrating my husband's birthday. Toshi is a Japanese restaurant that offers an Omakase experience with 2 chef choice…” more", "Delivery", "Takeout", "4 star rating"], "87. Midori Ramen": ["RamenMilliken", "Open until 9:30 PM", "“Tried Midori ramen for the first time two weeks ago. I was intrigued to try it because there was a lot of hype for it in the beginning. I ordered the original…” more", "4 star rating"], "88. Matsuya Korean House": ["Korean$$Greensborough", "Open until 10:00 PM", "“Honestly, I was not really sure what to expect when I came here, and I mainly picked it due to its proximity to the York Region COVID-19 vaccine clinic (just…” more", "3.5 star rating"], "89. Main St Greek": ["Greek$$Markham Village", "Open until 10:00 PM", "“Good food and excellent service. Staff were friendly and food arrived quickly. Restaurant is also bright and well kept.” more", "Delivery", "Takeout", "4 star rating"], "90. Azabu": ["JapaneseBarsBistrosLangstaff", "Open until 2:00 AM", "Live wait time: 0 mins", "“Excellent food. Great services. Nice ambiance. Will definitely eat at Azabu again and recommend to others” more", "Outdoor seating", "Delivery", "Takeout", "Find a Table", "4.5 star rating"], "92. La Petite Colline & Shan Shan Cafe": ["BakeriesCafes$$", "Closes in 38 min", "“Cute cafe/ brunch spot with an Asian fusion twist! Came here for weekend brunch and although it was busy, we got a table for 2 pretty quickly. The ceilings…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "93. Garden Hong Kong Cafe": ["Hong Kong Style Cafe$Unionville", "Closes in 38 min", "“This little hidden gem is hidden within Langham Square! Delicious food without breaking the bank. The milk tea tasted great- not diluted at all! I ordered the…” more", "Takeout", "3.5 star rating"], "94. Dickens Restaurant": ["SteakhousesAsian FusionHong Kong Style Cafe$$Buttonville", "“Dickens is located on apple creek and woodbine in Markham. Definitely one of the well known chinese restaurants since its one of my parents go to restaurants…” more", "Outdoor seating", "Takeout", "4 star rating"], "95. Good Taste Casserole Rice - Unionville": ["Chinese$$Unionville", "Open until 10:00 PM", "“We ordered through Uber eats and the value was still decent. The rice averages $15 per pot and you can add $3 for extra meat. There was so much meat that we…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "96. Sura Korean Cuisine": ["Korean$$Unionville", "Open until 9:00 PM", "“Good flavours of gochugang and spice in their stews. Good amount of toppings in them as well. Not overly salty which I prefer. Decent range of options.…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "97. Yin Sushi Market": ["JapaneseSushi BarsPokeUnionville", "“Cute takeout place in the outer circle of Langham Square! Ordered a bunch roll platter, which was the same price as shown on Ubereats because it was an…” more", "4.5 star rating"], "98. Tsuyoi Izakaya": ["Sushi BarsJapaneseUnionville Mainstreet", "“Got the following items: *Tornado Roll - All the ingredients in this roll worked so well together! It consisted of spicy torched salmon, tempura shrimp, crab…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "99. Alchemy Coffee": ["Coffee & TeaBreakfast & Brunch$$Unionville", "Closed until 8:00 AM tomorrow", "Waitlist opens at 8:00 am", "“Great food and and even better service! 10/10 would return and recommended to others to try!” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "100. bb.q CHICKEN": ["Chicken ShopChicken Wings", "Open until 11:00 PM", "“Just found out this new location of BBQ chicken.... Ordered a corn salad to start off, then a classic chicken and secret sauce chicken Very polite service,…” more", "5 star rating"], "102. The Flying Fish": ["JapaneseSushi BarsAsian Fusion", "Open until 9:30 PM", "“Came here with a couple friends to try items from this restaurant's new menu! -[Wasabi Cream Carbonara] $19.85 (8/10) Personally, I love the flavor of wasabi…” more", "4 star rating"], "103. Oo-Kinza Fish House": ["JapaneseSushi BarsSeafoodScarborough", "Open until 9:00 PM", "“Lucky to have visited this place a number of times. Although it's not cheap, I believe the food quality does justify the higher costs. Service is ok and…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "104. Buwan": ["FilipinoDessertsScarborough", "Closes in 34 min", "“Saw this place on instagram and my wife wanted to try it for her birthday. Reached out to them on Instagram where they made some suggestions and I placed an…” more", "5 star rating"], "105. King of Wings": ["Chicken Wings", "Open until 11:00 PM", "“Kings of Wings has been on my to try list for quite a while. Finally got to try it last night when meeting up with the guys after work. They had a great…” more", "4.5 star rating"], "106. Tapagria Spanish Tapas": ["SpanishTapas BarsSeafood$$", "Open until 11:00 PM", "“Incredible valentines Prix Fix tasting menu. My partner and I chose the second option ($195) to try tons of the menu and see which would be worth getting next…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "107. Kingsfield Chinese Cusine": ["Chinese", "“All dimsum taste same at every location...service and space are fine nothing bad.” more", "3.5 star rating"], "108. Classic Greek": ["Greek", "“Great portions and love the choice of two sides. Ordered veflggies and salad. Both were tasty. Came with salad dressing and Greek yogurt on the side” more", "4.5 star rating"], "109. Baben Sushi": ["Sushi BarsJapanese", "Closes in 34 min", "“Good value sushi. Not like the typical budget sushi (Ai sushi). The variety of sashimi is very good. Fatty tuna etc. Great presentation for parties .…” more", "5 star rating"], "110. Gyubee Japanese Grill - Markham": ["JapaneseBarbeque$$$", "Open until Midnight", "5 years in business", "Free parking", "Waitlist is closed", "“I had an exceptional experience at Gyubee last night and would recommend it to anyone. The service was fantastic as we never had to ask for another refill, to…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "112. Costa Sorrento": ["PizzaItalian$$$Unionville", "Closes in 31 min", "“Busy Italian place in the core of downtown Markham with nice renovations and a very open spacious feel. Our server was super sweet and constantly checked on…” more", "Delivery", "Takeout", "3 star rating"], "113. Folco’s Ristorante": ["Italian$$$Markham Village", "Open until 10:00 PM", "“What a wonderful experience! The staff are pleasant and warm. They welcomed everyone with so much respect and with their friendly spirit. The minute we…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "114. Hey Moo Moo": ["NoodlesBubble TeaRamen", "Open until 9:30 PM", "“I visited Hey Moo Moo Milk Tea Shop recently based on the recommendation from my cousin who lives in Stouffville and she was not wrong with her suggestion! A…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "115. MiKi Sushi": ["Sushi BarsJapanese$$Unionville Mainstreet", "Open until 10:00 PM", "“Miki Sushi has the best flamed Sushi in the Markham area - the rolls are huuuuuge! We loved the pressed salmon sushi so much I brought my mother in-law” more", "Outdoor seating", "Takeout", "4 star rating"], "116. Hong Kong Chicken": ["HakkaSoupCantoneseUnionville", "Open until 9:00 PM", "“Salt baked chicken leg tender and well seasoned, would recommend. Staff there pretty courteous and helpful with recommendations. Price is reasonable.” more", "4.5 star rating"], "117. Yin Ji Chang Fen": ["ChineseUnionville", "Open until Midnight", "“Fast clean service. Clean and roomy location but parking is a challenge during rush hour. There are an underground parking close by. The congee is good and…” more", "Takeout", "4 star rating"], "118. Pho Time Authentic Vietnamese Eatery": ["Vietnamese$$", "Open until 8:30 PM", "“Pho is probably one of the best comfort meals... I was pretty excited to check this spot out since it was very close to me. The overall restaurant was very…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "119. Slice of Fire": ["Pizza$Unionville", "Closes in 31 min", "“I am not a huge fan of pizza, but this place is very good. I can't wait to try other toppings” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "120. Terre Rouge": ["French$$$Unionville", "Open until 10:30 PM", "“Terre Rouge is a hybrid-French, luxury restaurant that does it right. To begin, when one walks in, they are greeted by friendly, attending staff. The…” more", "Outdoor seating", "3 star rating"], "122. Corner 20 Cafe": ["CafesBakeriesBreakfast & Brunch$$Unionville", "Closed until 8:00 AM tomorrow", "“This was a place we found through Yelp when we trying to find a place to hang out after running. It's in a tactically great location, within the fringes of…” more", "4.5 star rating"], "123. Miss Lin Cafe": ["Cafes$$Brown's Corners", "“Great place for delicious Taiwanese Snacks such as popcorn chicken, Sweet Potato Fries, Chinese sausages and noodles. They also have great selection of…” more", "Outdoor seating", "Takeout", "3 star rating"], "124. Wings Up!": ["Chicken WingsUnionville", "Open until Midnight", "“This little gem opened up about a month ago. Placed the order online and went to pick it up. Online ordering is very easy and there's a lot of customization…” more", "4.5 star rating"], "125. Tanuki Restaurant": ["Japanese$$", "Open until 9:00 PM", "“A little hidden gem in Japan Town located in Markham! Every Friday - Sunday they update their menus so you'll always get a chance to try something new. Taro…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "126. Confused Kitchen": ["BurgersSri LankanMilliken", "Open until Midnight", "“Spicy lovers come hither - Confused Kitchen has your back. The food here is packed FULL of flavor and spice. The spice levels are definitely higher than the…” more", "Takeout", "4.5 star rating"], "127. Gold Spring": ["Hong Kong Style CafeUnionville", "“Great HK breakfast spot. Decent prices, good combinations and food was great We ordered satay beef noodles vermicelli and instant noodles. One came with the…” more", "3.5 star rating"], "128. New City Restaurant": ["Chinese$Unionville", "Closes in 28 min", "“Good portions at good prices. Lot of meals come as combos so you get soup and drink as well. Lot of different menus focused on different kind of items, so…” more", "Outdoor seating", "4 star rating"], "129. Chef Papa Tea & Noodle Bar": ["Asian FusionNoodlesRamen$$Unionville", "Open until 10:00 PM", "“Portions are huge and I eat 6 pieces of pizza in one sitting. One bowl of noodles put me into a food coma within 10 min. This place is as spacious as a hk…” more", "Takeout", "3.5 star rating"], "130. Starving Artist Waffles & Espresso": ["Breakfast & BrunchWafflesCafes$$Unionville", "Closed until 9:00 AM tomorrow", "“Another weekend, another brunch This is definitely a well known markham hidden gem that I've seen here and there on social media. I'm a big lover of both…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "132. The Bernese Barista": ["Cafes", "Closed until 8:00 AM tomorrow", "“Adorable dog-friendly cafe with great coffee, large pupcups for the dogs, and very clean floors (always a challenge in a dog-friendly building)! I brought my…” more", "Outdoor seating", "Delivery", "Takeout", "5 star rating"], "133. Jian Bing Club": ["ChineseTaiwanese", "“Finally tried Jian Bing Club! The restaurant is in the same plaza as Chillax and Ai Sushi. Big red sign so it's easy to find. There's not a lot of parking…” more", "3.5 star rating"], "134. Pho Metro": ["VietnameseComfort FoodNoodles$$", "Closes in 54 min", "“Pho Metro is by far the best place to get Vietnamese food in Markham! When you first walk in it looks like your average restaurant but when I say the food is…” more", "Delivery", "Takeout", "4 star rating"], "135. The Toston": ["Colombian$$Box Grove", "Closed until Noon tomorrow", "“After visiting Florida and trying a Columbian restaurant over there I was craving some good Columbian food. I searched for restaurants around me and that's…” more", "Delivery", "Takeout", "4.5 star rating"], "136. Gimbap Shop": ["KoreanThornhill", "“Insanely huge and delicious Gimbap. Made to order. Tasted fresh and I liked that it wasn't heavily flavored. Reasonable price as well. If I lived near by I…” more", "5 star rating"], "137. Shu Kingdom General Hot Pot": ["Hot Pot$$$Milliken", "Open until 2:00 AM", "Live wait time: 0 mins", "“Second time visiting this restaurant. Delicious food. Nice staff. Lots of parking. Affordable prices. Beautiful decor, great music, gender neutral bathrooms.…” more", "Outdoor seating", "Delivery", "Takeout", "Find a Table", "4.5 star rating"], "138. KingKong Tteokbokki": ["KoreanLangstaff", "Open until 10:00 PM", "“I really like tteokbokki. It's filling, tasty and simple. KingKong really doesn't disappoint here and they have a ton of tteokbokki options than I knew existed…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "139. Bao Express": ["Dim Sum", "“I found this new restaurant when I was looking for a parking space for T&T errands. As a Xiao Long Bao (XLB) lover, who knew other Goubuli locations -Richmond…” more", "4 star rating"], "140. The Dumpling King": ["TaiwaneseDumplingsChinese$$Unionville", "“Came back here -I am a Xiao Long Bao (XLB) enthusiast. But I was not here to satisfy my XLB cravings today, because of the previous disappointment and the fact…” more", "Takeout", "3.5 star rating"], "142. Mala Town": ["ChineseHot PotNoodles$$", "Open until 2:00 AM", "“First Impressions ============= Host greeted us with a warm welcome and made sure we knew how everything worked. Super friendly service--good explanation to…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "143. Super Chicken": ["Chicken ShopFast FoodBurgers", "“Chicken is very crispy on the outside and juicy on the inside. Price is reasonable and they are offering 10% if you follow them on Instagram as part of their…” more", "Takeout", "4 star rating"], "144. Chef 88": ["Chinese$$Milliken", "Open until 10:00 PM", "“This is a traditional Chinese restaurant serving Yue cuisine. We've been there several times and they also have private rooms with karaoke, so it's pretty nice…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "145. Koke Teppanyaki & Bbq": ["JapaneseBarbequeBrown's Corners", "Open until 11:30 PM", "“Delicious teppanyaki making you super full and having a lot of leftovers to bring home. Loved how the chefs were very engaging and fun. Very different…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "146. Phoenix Restaurant": ["Hong Kong Style CafeDessertsWaffles", "Open until 9:00 PM", "“Phoenix bringing the food Cha chaang tang to north York. Slightly higher than average priced CCTs, the prettier presentations slightly justify the 20% mark up…” more", "4 star rating"], "147. Xin Yi Time": ["TaiwaneseBubble TeaIce Cream & Frozen Yogurt", "Closes in 21 min", "“Excellent service friendly staff. Good price and foods are healthy and tasty. No seating though so take-out only.” more", "3.5 star rating"], "148. Church’s Texas Chicken": ["Fast FoodChicken Wings", "Open until 10:00 PM", "“This place especially the location is a favourite amongst our household. Each time we go its always made fresh, never stale. Even after 15 minutes of driving…” more", "Delivery", "Takeout", "3.5 star rating"], "149. Pho Vinh": ["Vietnamese$$", "Open until 9:00 PM", "“Amazing AUTHENTIC Vietnamese food in Richmond Hill (finally). Meats are truly grilled (not pan fried), pho broth is not super salty, brisket/beef tastes…” more", "Outdoor seating", "Delivery", "4 star rating"], "150. Taoyuan Neverland": ["Hong Kong Style CafeCafesChineseUnionville", "“During this pandemic, one of my pastimes that I have picked up is browsing food apps to decide where I should go to get takeout. Last week, I was looking at my…” more", "Takeout", "4 star rating"], "152. Zen Japanese Restaurant": ["JapaneseSushi Bars$$$$", "Open until 10:00 PM", "“I absolutely love this neighborhood . Usually ppl would think the best omakase places are usually in the city (Toronto) but I'm so glad that in Markham there…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "153. Haidilao Hot Pot": ["ChineseUnionville", "Open until 2:00 AM", "“Very attentive, and one of the better hot pot places I have been too. Super clean environment. I wished I had a chance to do a manicure cause I saw another…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "154. Gyubee Japanese Grill - Scarborough": ["JapaneseBarbeque$$$Milliken", "Open until Midnight", "Live wait time: 181 - 211 mins", "“It's always busy in there.. my family of 6 waited for at least 2hrs. It was a weekend so thats a fair wait. The food is great! Service is okay , because the…” more", "Outdoor seating", "Delivery", "Takeout", "Join the Waitlist", "4.5 star rating"], "155. Jake’s On Main": ["PubsBurgers$$Unionville Mainstreet", "Open until 2:00 AM", "“Great patio! Line moves fast, so don't give up! Service was pretty good; there are a lot of servers, so sometimes it's hard to find yours. Prices are pretty…” more", "Outdoor seating", "Delivery", "3 star rating"], "156. Santo’s Italian Cuisine": ["Italian$$$Langstaff", "Open until 11:00 PM", "“A quaint, intimate Italian restaurant in an unassuming plaza, it'll definitely be one of our choices for tasty Italian dishes. Good quality and large portions,…” more", "Delivery", "Takeout", "4 star rating"], "157. Espresso 21": ["Cafes$$Unionville Mainstreet", "Open until 10:00 PM", "“It's a nice place to have coffee or lunch. I enjoy to have a time of myself. Happy Valentine's Day !!!” more", "Outdoor seating", "Delivery", "Takeout", "3 star rating"], "158. Jeon Ju Hyang": ["KoreanUnionville", "“The location on iPhone maps is not that helpful. It's closer to the Canada Computers than it is to Nofrills!! Went for a late lunch. Food was yummy and the…” more", "4 star rating"], "159. Sushi Umi": ["Sushi Bars$$$$Brown's Corners", "Open until 10:00 PM", "“Time to update my review of Sushi Umi. OK... it's a 5-Star!!! Maybe my tastebuds were off a year ago... then again, maybe my tastebuds were spot on but I was…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "160. A Corner Cafe": ["CafesBreakfast & BrunchCoffee & Tea$$Unionville", "Closes in 17 min", "“A CORNER CAFE (Review for North York Location) . . They recently opened a second location in North York. I've never been to their Markham location so I wasn't…” more", "Outdoor seating", "Takeout", "4 star rating"], "162. Thai 5 Cafe": ["Thai$", "Closed until Tuesday", "“I discovered this hidden gem while I was getting takeout from another vendor and the Blue Moon Party Tray instantly caught my eyes! The platter is listed as…” more", "4 star rating"], "163. Joey Markville": ["Canadian (New)LoungesSteakhouses$$$Unionville", "Open until 1:00 AM", "“When this location first opened in Markville Mall, I had only dined at Joey Restaurants maybe 2-3x at other locations. This location has now become one of my…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "164. Haru": ["JapaneseKorean$$", "Open until 10:30 PM", "“Would come back here for the donburi. Not pictured are the veg spring rolls, which were also perfectly crispy with a juicy filling.” more", "Takeout", "4 star rating"], "165. AKA-ONI Ramen&izakaya -Scarborough": ["JapaneseSushi BarsAsian Fusion$$Milliken", "Open until 2:00 AM", "“FYI: this restaurant does not have high chairs. Bring your own booster. Pricey but overall good quality. Came here on a weekday for lunch and the restaurant…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "166. Pizzamaru": ["Pizza", "Open until 10:00 PM", "“Had the bulgogi golden crust twice now and loveed it. The fusion of the sweet potato and cheese was such a nice combination and since it's somewhat a heavy…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "167. EAT BKK Thai Kitchen & Bar": ["Thai$$", "Open until 10:30 PM", "“I ordered from here through door dash and I had Khao Soi and veggie spring rolls, everything was so delicious! The khao soi was packaged perfectly so that dish…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "168. Daldongnae": ["KoreanBarbeque$$$", "Open until 2:30 AM", "“Long waiting time. Foods are just okay compared to other Korean Samgyupsal restos. Staff are so nice and kind” more", "Outdoor seating", "Takeout", "4 star rating"], "169. Cotolet Premium Cutlet": ["Japanese$$", "Open until 9:00 PM", "“This spot is a true Richmond Hill gem, and perhaps my favourite place to get Katsu! It has a slightly more upscale vibe compared to competitors, as it is clean…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "170. Gyu Hito Japanese BBQ Restaurant": ["JapaneseBarbeque$$$Milliken", "Open until 10:30 PM", "“Came back again recently for a friend's bday. The boneless short rib and ribeye steak are still my fave cuts. Daddy is hungry just thinking about them. The…” more", "Outdoor seating", "4 star rating"], "172. Station Pizza": ["ItalianPizza$$", "Open until 10:00 PM", "“It only took me 25 years to finally make my way to try this amazing place that people have been talking about for years. I am so glad that I finally caved…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "173. Krispy’s Kajun Chicken": ["Fast FoodHalalChicken Shop$Unionville", "Open until 11:00 PM", "“Krispy's Kajun Chicken is my favorite go-to, whenever I have a craving for fried chicken! The owners are incredibly friendly, and the chicken is fresh, crispy,…” more", "Delivery", "Takeout", "4 star rating"], "174. Mapo Gamjatang": ["KoreanSoupMilliken", "Open until 10:30 PM", "“Super happy for this Scarborough location as I've been wanting to visit their North York location for the longest time! The pork bone soup was perfect for a…” more", "4 star rating"], "175. Bingz Crispy Burger": ["BurgersChineseBrown's Corners", "Open until 9:30 PM", "“Was wondering around and saw this store front so I decided to just give it a try. They had a quick QR code scan/order system but since there wasn't a line I…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "176. Phoenix Restaurant": ["ChineseHong Kong Style Cafe$$Unionville", "Open until 10:00 PM", "“Been coming here for a number of years. Their Hainanese Chicken dish has always been a favourite and is consistently delicious. Tried their pork chop with…” more", "Delivery", "Takeout", "3 star rating"], "177. Mother Goose": ["CafesFast Food$Unionville Mainstreet", "“This abandoned hut in the Toogood pond park has finally been adopted and turned into a café. It's nice to have a café to stop at for a coffee, ice cream, snack…” more", "3.5 star rating"], "178. AKA-ONI Ramen & Izakaya": ["JapaneseSushi Bars$$$", "Open until Midnight", "“The food is really fresh; it is marginally better than other sushi restaurants. The sashimi has a certain chew to it, and it doesn't taste extra wet as if it's…” more", "Delivery", "Takeout", "4 star rating"], "179. Ithaca Greek Mediterranean Restaurant": ["MediterraneanGreek$$Unionville", "Open until 9:30 PM", "“I've ordered and gone to this restaurant countless times! It's a great Greek place in the area my 2 year old boys love it - it's one of their favourite places…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "180. 3 Mariachis Express": ["Mexican", "Open until 10:30 PM", "“I love, love, love this restaurant! I've ordered takeout many times and their quality is always consistent. My favorite is their Mariqchi platter when I cannot…” more", "4 star rating"], "182. Sumilicious Smoked Meat & Deli": ["DelisSandwichesPoutineries$$Scarborough", "Closed until 11:00 AM tomorrow", "“The poutine was delicious. It was nearing the end of the day so they were running out of certain meats” more", "Delivery", "Takeout", "4.5 star rating"], "183. Izakaya Ju": ["JapaneseSushi Bars$$", "Open until 10:30 PM", "“First came here some years ago and tried chicken heart for the first time. I enjoyed it so much! I came back recently but unfortunately they've removed chicken…” more", "Delivery", "3.5 star rating"], "184. Mom’s Kitchen": ["Korean$Unionville", "Open until 10:00 PM", "Discounts available", "Free parking", "“Ordered in doordash and was impressed by the portion size - great value! My soondubu was proper spicy and thoroughly delicious. 10/10 would order again” more", "Delivery", "Takeout", "3.5 star rating"], "185. Hey Noodles": ["ChineseNoodles$$Unionville", "“Delicious noodles. The noodle texture was very good. They have unlimited noodle refill which is great for people who eat a lot. I also like how they close…” more", "Delivery", "4 star rating"], "186. OFFOOD": ["BarbequeSoupHot PotUnionville", "Closed until 11:00 AM tomorrow", "“There is no better way seeking a BBQ like this: Fast,Fresh, Feast. Ready in minutes. Less preparation, more joy with friends.” more", "Delivery", "Takeout", "3.5 star rating"], "187. Mabu Cafe": ["DessertsCoffee & TeaHong Kong Style Cafe$$Scarborough", "“I must say that the vibes here are immaculate - I absolutely love the decor! Food wise, I decided to get the baked cheese spaghetti with tomato sauce and pork…” more", "4 star rating"], "188. Nangman Pocha": ["BarsKorean", "Open until 2:30 AM", "“Located just right across from Centre Point Mall, Steeles and Yonge. We had the opportunity to taste some genuine Korean food. Yes, for the first time that I…” more", "Delivery", "4 star rating"], "189. Amazing Seafood House": ["Seafood$$$$Unionville", "Open until 10:00 PM", "“This place is honestly a hit or miss - some days the food is great, other times it's mediocre. Unfortunately the service is usually a miss given the lack of…” more", "Takeout", "2.5 star rating"], "190. Ambiyan": ["IndianGastropubs$$Unionville Mainstreet", "Open until 9:00 PM", "“If you're looking for a place to dine in Main Street Unionville, you should give Ambiyan a try! We had just finished a morning stroll in TooGood Pond park…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "192. MABU Generation": ["Taiwanese$$Brown's Corners", "Open until 1:30 AM", "“A few years ago... Cant stop going to this place and ordering practically the same items : The seafood milk and cheese hot pot (yes , it is that good but I I…” more", "Takeout", "3.5 star rating"], "193. Aneal’s Taste of the Islands": ["Caribbean$$", "Open until 9:00 PM", "“I've been going to Aneal's Taste of the Islands since the pandemic and now it's an almost weekly takeout treat. I usually get the large jerk chicken and…” more", "Delivery", "Takeout", "4.5 star rating"], "194. La Grotta on Main": ["ItalianCanadian (New)Venues & Event Spaces$$$Unionville Mainstreet", "Open until 10:00 PM", "“Enjoyed a wonderful meal on the covered patio on a chilly evening on the last week of October 2020. Covid restrictions were well followed, tables spaced out…” more", "Outdoor seating", "Delivery", "Takeout", "2.5 star rating"], "195. Hanyang Jokbal": ["Korean$$", "Open until 1:00 AM", "“This place is JAM PACK, and they do not accept reservations. So if you going in with a bigger group or during busy hours, there is a possibility of a 30-1hr…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "196. Santorini Grill": ["Greek$$", "Open until 11:00 PM", "“This place is perfect. I have been to many Greek restaurants and this one is simply the best, hands down. Authentic food, beautiful ambiance. Every dish we…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "197. Skewersguy Japanese BBQ & Bar": ["BarbequeBeer BarJapaneseMilliken", "“Definitely a hidden new gem. The service was excellent, helpful and attentive. We order the set dinner and amongst the four of us, we chose steamed lobster…” more", "3.5 star rating"], "198. Real Kebab": ["AfghanKebabSaladGreensborough", "Open until 9:00 PM", "“I've been twice and I've only had the beef chapli. It's so memorable that I did not want to try anything else. The 2 sauces , 1 is a hot sauce and the other…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "199. Hong Bo Burger & Poutine": ["BurgersPoutineriesSandwichesBrown's Corners", "Closed until 9:00 AM tomorrow", "“The shrimp burger I got was really fresh, steaming and crispy. I simply adore shrimp burgers. The ratio of sauce was pretty good although personally I would've…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "200. Fu Kee Bao Dim": ["Dim SumUnionville", "Closed until 9:00 AM tomorrow", "“I have been coming here for the past few months to get my dim sum fix. Prices are very reasonable and quality is superb. My dad loves the bbq pork bun and…” more", "4.5 star rating"], "202. Yunshang Rice Noodle House": ["ChineseNoodles$$Brown's Corners", "Open until 10:30 PM", "“This place really satisfied my soup noodle craving! Any soupy noodle is my favourite thing to eat and YunShang Rice Noodle House understood the assignment . I…” more", "Delivery", "Takeout", "4.5 star rating"], "203. Sansotei Ramen": ["Japanese$$Unionville", "Open until 10:00 PM", "“One of the better ramen restaurants. Broth tasted good. Service was good as staff was friendly.” more", "3.5 star rating"], "204. Steak Supreme": ["BarsSteakhousesAsian Fusion$$Scarborough", "Open until 11:00 PM", "“Love this place. The owner is very friendly. Portions are good and very tasty. For $3x you get a soup, an entree and a drink. I'd say it's a steal. I…” more", "3 star rating"], "205. Bao Mama": ["Asian FusionFilipinoScarborough", "Closes in 31 min", "“Such a good consistency of bao to good ratios. They make sure you leave with a good stomach.Beef Briskets” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "206. Ruth’s Chris Steak House": ["SteakhousesLoungesSeafood$$$$Unionville", "Open until 10:00 PM", "“I came here for Winterlicous 2023 with a party of 2 and had a wonderful time. The ambiance and service were excellent, and our server Paul H. was very kind.…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "207. Hibiki Japanese Cuisine": ["JapaneseSushi Bars$$Unionville", "Open until 9:00 PM", "“TLDR: Driven past this place several times, and to be honest, I had never really given it a second thought. This visit certainly changed that for the best! I…” more", "Delivery", "Takeout", "3.5 star rating"], "208. Six Social Kitchen & Wine Bar": ["American (Traditional)Wine BarsSaladScarborough", "Open until 10:00 PM", "“We happened upon this restaurant by accident and decided to give it a try. What a pleasant surprise! Food was great. We ordered the paella. Beautiful flavors.…” more", "Delivery", "Takeout", "4 star rating"], "209. Jatujak Thai Cuisine": ["Thai$$Scarborough", "Open until 10:00 PM", "“Love this place! On a blustery, chilli afternoon dropped in for some take soups: tom yum with shrimp and tom Khai (coconut milk and chicken) soup. Fast,…” more", "3.5 star rating"], "210. Choi Restaurant": ["VietnameseMilliken", "Open until 11:00 PM", "“A small restaurant located inside the Silver Star plaza. Lots of free parking! Upon arrival, I was greeted and staff were very nice. The restaurant is very…” more", "4 star rating"], "212. Araya Sushi": ["Sushi BarsJapaneseKoreanMarkham Village", "Open until 10:00 PM", "“Surprising gem of a sushi place in Markham. Prices are fair and sushi tasted pretty good. We got the medium maki combo (48 pcs for $52). I'm usually pretty…” more", "Delivery", "Takeout", "4 star rating"], "213. Lanna Cuisine - Temp. CLOSED": ["ThaiUnionville", "Closes in 57 min", "“Update to Original Review **** Management reached out to me and was apologetic and offered to redo the evening for us as it had put a damper on the evening. I…” more", "Outdoor seating", "Delivery", "Takeout", "3 star rating"], "214. Katsuya": ["Japanese$$", "Open until 11:00 PM", "“Loved the porker Katsu with the spicy carbonara sauce topped with garlic chips! The Katsu was perfectly crispy outside and the meat inside was well seasoned…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "215. Citro Italian Restaurant": ["Italian$$", "Open until 10:00 PM", "“John was extraordinary! He made us an amazing Italian meal! . One man show cooked all our meals! Culinary kudos!!” more", "Delivery", "4 star rating"], "216. Cafe Bon Bon": ["Coffee & TeaAsian FusionBreakfast & Brunch$$", "Closes in 27 min", "“There's no getting around it; this place is really well designed and pretty. The lighting and ambience is on point. In terms of the food I would say it's…” more", "Delivery", "Takeout", "3.5 star rating"], "217. Phoenix Restaurant": ["Hong Kong Style CafeDessertsWaffles", "Closes in 57 min", "“Phoenix bringing the food Cha chaang tang to north York. Slightly higher than average priced CCTs, the prettier presentations slightly justify the 20% mark up…” more", "4 star rating"], "218. Onnuri": ["KoreanNoodlesChicken Shop$$Scarborough", "Closes in 57 min", "“OMG, this place is just awesome. Their chicken is just fantastic. Awesomely done. You have to come here for a pilgrimage if you love Korean fried chicken. I…” more", "Outdoor seating", "Takeout", "4 star rating"], "219. Han Mi Jeong": ["Korean$$", "Open until 10:00 PM", "“I might have found my new go to spot for Korean food in Richmond Hill! Han Mi Jeong has been a long time staple at Richlane Mall and for good reason! They…” more", "4 star rating"], "220. Pho Time Authentic Vietnamese Eatery": ["Vietnamese$$", "Closes in 27 min", "“Pho is probably one of the best comfort meals... I was pretty excited to check this spot out since it was very close to me. The overall restaurant was very…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "222. Zeal Burgers": ["Burgers", "Open until 10:00 PM", "“Delicious burgers - and the buns are tasty too. Wonderful (and very generous helping) Yukon gold fries. The onion rings are great. We have tried the 'Z'…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "223. Muncheez": ["CreperiesDelis$$", "Open until 1:00 AM", "“This place is great if you like crepes. I have had most varieties on the sweet and savoury side. My go to's are typically the BLT, Phillys own and also…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "224. XiangZi Hotpot": ["Hot PotChineseSoup$$$Unionville", "Open until 11:00 PM", "“As soon as we walked in we were impressed by how big, spacious, and nice the restaurant is. We were even given a cover to throw over our jackets and an apron…” more", "3 star rating"], "225. Essence of Unionville": ["Breakfast & BrunchJuice Bars & SmoothiesCanadian (New)$$Brown's Corners", "Open until 10:00 PM", "“As we come to an end for 2022, I have been going back through some of my fav spots for dining in 2022. Essence of Unionville is def on that list! Service is…” more", "3.5 star rating"], "226. Nian Yi Kuai Zi": ["ChineseMilliken", "5 star rating"], "227. Roses Cafe Senso": ["Persian/IranianDessertsCafes", "“What a find! After finding that Demetres and Tim Hortons were both closed on a Saturday night, we went to the next plaza over and discovered this incredible…” more", "5 star rating"], "228. Flavourful House": ["Chinese", "Open until Midnight", "“Super delicious and unique Chinese food. Ate dinner with the whole family for my grandma's birthday. All the food tastes great and service was good too” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "229. Tasty Pot": ["TaiwaneseBubble TeaHot Pot$$", "Open until 11:00 PM", "“I came with a friend (i.e. table for two) around noon for lunch. We were both surprised to see how busy this place was on a weekday (i.e. Tuesday). I'm pretty…” more", "Takeout", "4 star rating"], "230. Tahini’s": ["Middle EasternMediterranean", "Open until 11:00 PM", "“SO GOOD!! Tahini's is an awesome shawarma/middle eastern spot in Richmond Hill. They have a unique menu which is quite extensive, and when you order you give…” more", "4.5 star rating"]}