{"2. Ay Caramba, Eh": ["Mexican$$", "Open until 10:00 PM", "“Great mexican food! I would highly recommend. Great vibes too.” more", "Delivery", "Takeout", "4.5 star rating"], "3. Toro Toro": ["JapaneseSushi Bars", "“I have tried quite a few Sushi places in Toronto, but this one is hands down the best! They have a great menu selection. There's something for everybody.…” more", "Outdoor seating", "Takeout", "4.5 star rating"], "4. Taste of Naples Pizzeria": ["PizzaItalian$$", "Open until 9:00 PM", "“Pickup option only. Call in your order. They will give you a number and there is an electronic number screen on the window. Go in when your number…” more", "Takeout", "5 star rating"], "5. Southeast Sandwiches": ["Sandwiches$", "Open until 10:00 PM", "“I was passing by the area last Friday and was intrigued by the raving reviews of this sandwich shop so I gave it a try and wow, the food was excellent! The 5…” more", "Delivery", "Takeout", "5 star rating"], "6. Marcellos Pizzeria": ["PizzaItalian$$", "Open until 10:00 PM", "“Stick with salads and pasta... the pizza crust very disappointing... almost a whole wheat bread texture..not the usual chew you get with wood oven. Nice wait…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "7. Bueokae Korean Restaurant - Love’s Kitchen": ["Korean$$", "Open until 10:30 PM", "“Been coming here since almost the beginning now and it's always so consistent and delicious. Happy to see it get even popular! Nothing new to say compared to…” more", "Outdoor seating", "Takeout", "4.5 star rating"], "8. Porcello Cantina": ["Italian$$", "Opens in 58 min", "“Finally found a fun spot for a date night near home! Good thing we made a reservation earlier that day, as it was packed that night. Service was great, food…” more", "4 star rating"], "9. Arepa Guys": ["Venezuelan", "Open until 7:00 PM", "“This place is amazing I ordered some arepas and there were Delicious I really love to come here with my fiancé. When you walk in I instantly feel welcomed…” more", "4.5 star rating"], "10. Mr & Mrs Bao": ["Asian FusionComfort Food$", "Open until 9:00 PM", "“My friends and I ordered I love you so matcha, pork dumplings and four baos- Gangnam-style, So Sausage, Big Bird and Bang Bang Shrimp. Unfortunately, we didn't…” more", "Delivery", "Takeout", "4 star rating"], "12. Eli’s Table": ["Mediterranean$", "Open until 10:00 PM", "“Chicken shawarma plate was great. Everything was really full of flavour and has the perfect amount of seasoning. This food taste like someone's momma made it…” more", "Takeout", "4.5 star rating"], "13. Hank Daddy’s Barbecue": ["SouthernBarbequeSandwiches$$", "Open until 10:00 PM", "“Wow this place is putting out some amazing BBQ! As most of you know I had a 4 year stint in Austin, TX before making my way up here. I ate my way through a…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "14. R Sushi": ["JapaneseSushi Bars", "Open until 9:30 PM", "“An amazing new addition to our neighbourhood. Loved the sushi and the presentation. Dined I and ordered pick and both times loved it.” more", "4.5 star rating"], "15. Memphis BBQ": ["BarbequeAmerican (Traditional)$$Pine Grove", "Open until 9:00 PM", "“Great food and service. Many great options on the menu. Smoked wings are amazing along with many other great options like ribs and brisket.” more", "Delivery", "4.5 star rating"], "16. Kin Sushi": ["JapaneseSushi Bars", "Open until 10:00 PM", "“Not our usual area so we weren't too sure what would be a good place to eat. We found this place on the internet and drove there found it quite difficult to…” more", "5 star rating"], "17. PHO 128": ["VietnameseNoodlesEdgeley", "Open until 10:00 PM", "“Updating my review to 5 stars. I'm not sure if ownership has changed or if it is being run by the same owner since 2021, but they have changed their business…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "18. Pollo Loco Churrasqueria": ["Portuguese$", "Open until 7:30 PM", "“Lived in Vaughan my whole life, there is NO SPOT BETTER THAN POLO LOCO. This spot is the goat!!!!!!! What to Order: Quarter or Half chicken combo EXTRA LOCO” more", "4.5 star rating"], "19. Truly Thai Cuisine": ["Thai$$", "Open until 9:30 PM", "“Excellent hidden mom-and-pop restaurant that serves authentic Thai food with friendly service and traditional Asian decor. The waitress that served us was so…” more", "Outdoor seating", "Takeout", "4 star rating"], "20. Toronto Pho": ["NoodlesVietnameseSoupPine Grove", "Open until Midnight", "“Vietnamese food is one of my fav cuisine ! It's comforting, loaded with goodness & flavorful! After a long day at Wonderland, we opted to come to…” more", "4.5 star rating"], "22. IKON Sushi": ["JapaneseSushi Bars", "Open until 9:00 PM", "“Having been visiting Japan for ages. And after leaving Hong Kong, honestly the sushi scene seems dark and sad. But to my surprise, the sushi at IKON is very…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "23. Mama Fatma Turkish Cuisine": ["Turkish", "Open until 10:00 PM", "“We walked in without reservations and that was a mistake. Had to wait 20 minutes for a table for 7ppl but the wait was well worth it. We order 1 turkish grill…” more", "Outdoor seating", "Takeout", "4 star rating"], "24. Oca Nera": ["Italian$$$Pine Grove", "Opens in 52 min", "“Blink and you miss it because it is definitely a hidden gem. Behind a gas station on Islington this resto is a gem of culinary excellence. First off the…” more", "4.5 star rating"], "25. Efendi": ["TurkishKebabHalal", "Open until 10:00 PM", "“I visited Efendi for lunch after seeing it on social media. They do not take reservations for lunch so plan accordingly as there might be a wait. It was fairly…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "26. B’s Kitchen Fine Vietnamese Cuisine": ["Vietnamese$$Pine Grove", "Open until 10:00 PM", "“I've been to MANY many MANY pho restaurants over the GTA and will tell you that this place is in the top 3 of the best pho. They simmer their pho broth for…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "27. Tubbies": ["Breakfast & BrunchDinersBurgers", "Open until 10:00 PM", "“Wow what a great place. Service is impeccable and the food showed up so fast and hot it made our heads spin. Wow. And on a busy Saturday morning too. The…” more", "3.5 star rating"], "28. Bocconcino Ristorante": ["Italian$$", "Open until 10:00 PM", "“Bocconcino is a small Italian restaurant along Highway 7 in Vaughan. We had called this place on numerous occasions during the pandemic since we had a gift…” more", "5 star rating"], "29. What A Jerk Restaurant & Bar": ["CaribbeanChicken WingsItalian", "Open until 8:00 PM", "“My boyfriend and I just ordered from What A Jerk and the food was amazing. We had the jerk chicken with rice and peas. The portions were generous & the prices…” more", "Takeout", "5 star rating"], "30. Hibachi Teppanyaki & Bar": ["JapaneseSteakhousesSushi BarsPine Grove", "Open until 11:00 PM", "“Made a reservation for 9 people for a birthday party. We had a great time! Our chef was very skilled and the atmosphere was fun. This place gets busy,…” more", "4 star rating"], "32. State & Main Kitchen & Bar": ["BarsAmerican (Traditional)", "Open until Midnight", "“I always order from this place on UberEats. The food is super decent on the expensive side for sure, but the packaging and overall taste is pretty good” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "33. CopaCabana Brazilian Steakhouse": ["SteakhousesBrazilianLatin American$$$", "Open until 11:00 PM", "“Came here on Saturday to celebrate a birthday only to find out they no longer provide free birthday meals. Nonetheless, the service was great and they had a…” more", "3.5 star rating"], "34. Ricci’s Pizzeria & Sandwich Shoppe": ["SandwichesPizzaItalian$$Pine Grove", "Open until 9:30 PM", "“This one has been in my list for a long time. We went for a late lunch and got ourselves a 12\" pizza with veggie toppings and a meat ravioli. The person taking…” more", "Takeout", "4 star rating"], "35. Big Bone BBQ & Wicked Wings": ["Chicken WingsBarbequeSouthern$$Maple", "Open until 9:00 PM", "“Even before moving to vaughan, I have visited Big Bone BBQ and was impressed by their food. Recently, came here with a group of friends and got a party tray…” more", "4 star rating"], "36. Holy Smoke": ["BarbequeLangstaff", "Open until 7:00 PM", "“We decided to try this place on Ubereats as there was a BOGO deal. Food was prepared and delivered in adequate time. Packaging was well done for minimal…” more", "4.5 star rating"], "37. Tinh Tam Trai": ["VegetarianVietnamese$", "Open until 9:00 PM", "“Was looking up random vegetarian spots and this was the first place that popped up. Right across the plaza walking distance from Vaughan Mills, you will not be…” more", "4.5 star rating"], "38. Sinaloa Factory": ["Sushi BarsMexicanWoodbridge", "Open until 9:00 PM", "“Sinaloa Factory is amazing. The staff are pleasant and the food is delicious. There is such a large menu with vegetarian options as well. Sinaloa Factory…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "39. Artigianale Ristorante & Enoteca": ["ItalianWine BarsPine Grove", "Opens in 48 min", "“You would never know it to see it from outdoors, but this place was pretty awesome. Fresh pasta and homemade pizzas were fantastic, enjoyed the wine pairing…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "40. Belsito Trattoria": ["PizzaItalianMediterranean$$Kleinburg", "Opens in 48 min", "“Belsito Trattoria is a must-visit destination for Italian food lovers. The restaurant is comfortable, contemporary and offers a great selection of traditional…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "42. Pho Vaughan": ["Vietnamese$", "Open until 9:00 PM", "“We came here to grab a bowl of Pho on a very cold day. The servers here waived us to our seats and we got to ordering. I ordered the Deep Fried Spring Rolls…” more", "4 star rating"], "43. Bambū Dessert Drinks": ["Bubble TeaJuice Bars & SmoothiesVietnamese", "Open until 10:00 PM", "“Nice to see a place that vietnamese desserts. A tad pricier than typical boba places, and on par with the nicer boba places. Well worth it as you can tell the…” more", "Takeout", "5 star rating"], "44. Midori Ramen": ["Ramen", "Open until 11:00 PM", "Opened 3 months ago", "“Dined at the one in Scarborough. Glad that they opened another restaurant in Richmond Hill, closer to where I live. I was greeted warmly as I stepped into the…” more", "4 star rating"], "45. Creole Jamaican Kitchen + Bar": ["CaribbeanBarsPine Grove", "Open until 9:00 PM", "“Found this spot by luck and I'm sooo glad I found it!! It's relatively new and quiet here but trust me, their food is mind blowing. The jerk chicken has so…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "46. Fuoco Smokehouse": ["SmokehouseBarbequeItalian$$Pine Grove", "Opens in 45 min", "“A definite hidden gem located in the Weston Rd and Langstaff area of Woodbridge. Fuoco is a barbecue restaurant with a bit of an Italian twist. It only had a…” more", "4 star rating"], "47. Berlin Doner & Kebab": ["TurkishMediterraneanKebab", "Open until Midnight", "“Affordable prices, super delicious! I like to order the chicken Doner wrap and I'm never disappointed. The sauces that they use have the perfect balance of…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "48. 255 By Alta Rossa": ["ItalianPizza$$", "Opens in 45 min", "“An amazing Italian restaurant, I would definitely recommend it. The main draw is the food. I have tried a few of their pastas so far; the Paccheri Bolognese…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "49. Katsuya": ["Asian FusionJapanese", "Open until 10:00 PM", "“I love Katsuya's Katsus! They make the juiciest meatiest katsus with an incredible lineup of different sauces. I've tried chicken, fish, and now pork.…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "50. Spizzico": ["ItalianPizzaSeafood$$$", "Open until 11:00 PM", "“Spizzico has a very lovely interior design, we ordered a calamari appetizer, it was not as fresh as I would have liked, perhaps it was the quality of the fish.…” more", "3.5 star rating"], "52. The Doctor’s House & XXI Chophouse": ["American (Traditional)Venues & Event SpacesSteakhouses$$$Kleinburg", "Open until 8:00 PM", "“It's okay, nothing much to tell. Aside from some nice sceneries and ambiance, and being a fancy place if you wanna show it off. Other than that, i've been…” more", "Outdoor seating", "Delivery", "Takeout", "2.5 star rating"], "53. Ginger & Turmeric": ["Indian", "Open until 10:00 PM", "“Wow. Please go and try this Indian restaurant. We went last night. Very casual atmosphere and simple decorum. We ordered Biryani and Vindaloo with one order or…” more", "4.5 star rating"], "54. Pho Real": ["Vietnamese$$Pine Grove", "“The best!! Love this place and the staff!! Be sure to try the seafood spring roll ( it has meat as well). The mango salad that comes with it is delicious. Love…” more", "4 star rating"], "55. Farro Ristorante": ["Italian$$Maple", "Opens in 41 min", "“Was visiting town and a group of us (10 ppl) made reservations for April 2 (a Saturday night). When we arrived, our table wasn't ready, but within 5 minutes we…” more", "4 star rating"], "56. Chick-fil-A": ["Chicken ShopFast Food", "Open until 11:00 PM", "“Plenty of seating, 2 lane drive thru for those in a hurry. Ordered the original deluxe and spicy deluxe chicken sandwiches. Waffle fries were cooked…” more", "Delivery", "Takeout", "3 star rating"], "57. Cento40 Trattoria": ["ItalianPine Grove", "Open until 10:00 PM", "“I was invited to a friend's birthday dinner at this lovely restaurant on Saturday night. We were a party of approximately 13 and all all of the food came out…” more", "Delivery", "Takeout", "5 star rating"], "58. Chop Steakhouse & Bar": ["SteakhousesBars", "Open until 2:00 AM", "“Reservations made on Open Table, seated straight away for a lovely Anniversary dinner with attentive service and good food. The Tempura app was great (not low…” more", "4.5 star rating"], "59. Cielito Rico": ["MexicanDessertsCafes$$Edgeley", "Open until 7:30 PM", "“I love this store. The owners of the store are very friendly, welcoming, and helpful. It's a family owned store which is great because you gotta support small…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "60. Flaming Kitchen": ["Asian Fusion", "“FLAMING KITCHEN . . Food is always delicious here. I always order a noodle dish and my bf always orders a rice dish. We also tried an appetizer for the first…” more", "Delivery", "Takeout", "3.5 star rating"], "62. Forno Alimento": ["ItalianPine Grove", "Opens in 38 min", "“This is the place to be! I hadn't been in this spot for so long and I came back to find a new hot spot. To my complete delight it is a keeper!!! I had the…” more", "4.5 star rating"], "63. Myeongdong Gyoza Kalguksu": ["Korean", "Open until 9:00 PM", "“WOW. This is probably my favourite place to get noodles. This was so flavourful, and wasn't overly salty. The vegetables were an amazing touch. The dumplings…” more", "4 star rating"], "64. Beijing Sung": ["KoreanChinese", "Open until 9:30 PM", "“Beijing Sung is one of the few hybrid Korean Chinese restaurants in the GTA. However, the food isn't true Chinese food, but more tailored to Korean consumers.…” more", "4 star rating"], "65. Ozzy’s Burgers Vaughan": ["Burgers$$", "Open until 1:00 AM", "“Burger sizes aren't huge; The ingredients seem to be of good quality. They have these cheesy onions that explode when paired with a burger. And the meat is…” more", "Delivery", "Takeout", "4 star rating"], "66. Sofra Istanbul": ["MediterraneanTurkish$$", "Open until 10:00 PM", "“With out a doubt they have the best Pide in the GTA and we must have tried at least 10 Turkish restaurants around town before saying this bold statement.…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "67. Taste of Hakka": ["Hakka$$", "Open until 11:00 PM", "“After reading the reviews on here, my family and I decided to come here and now we're frequent customers here for both dine-in and take-out! Our favourites…” more", "Takeout", "3.5 star rating"], "68. AiTaiker Taiwanese Fried Chicken": ["Chicken ShopFast FoodThornhill Woods", "Open until 9:00 PM", "“Happy New Year's everyone! 2021 has been a wild one and it's time to move forward to 2022 with my first post of this year! I've been to Taiwan a few years…” more", "Delivery", "Takeout", "4 star rating"], "69. Aloha Poke": ["PokeHawaiian$$Pine Grove", "Open until 9:00 PM", "“Nice family shop. The portion is huge and great value. The fish is very fresh and the sauce is better than other Poke places we visited” more", "3.5 star rating"], "70. Motorino Enoteca": ["Italian$$Pine Grove", "Open until 11:00 PM", "“I would rate the food a 3.5 but the service bumps it up to a 4 :) We got a pizza, the spaghetti carbonara and the calamari. The food was good but nothing to…” more", "3.5 star rating"], "72. Avlyn Gardens Ristorante": ["Italian$$Kleinburg", "Closes in 35 min", "“Had our engagement luncheon today. Food was amazing,service exceptional. I would highly recommend to anyone looking for a place to host a special occasion.…” more", "4 star rating"], "73. Ajisen Ramen": ["Ramen", "Open until 11:00 PM", "“On a Saturday towards the end of July, I came to this plaza for Toco Tea. After fetching my bubble tea, I was hungry. It was nearly 4 pm and I hadn't had…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "74. Levetto": ["ItalianPizzaSalad$$Thornhill Woods", "Open until 9:30 PM", "“Wow!! Stumbled on to this place as close by to a kids indoor playground we were visiting, excellent pizza and pasta! Pizza is more focaccia style and…” more", "4 star rating"], "75. Pizza Break": ["PizzaItalian$", "Open until 11:00 PM", "“Best pizza place in town!!!.Everything is made fresh - no frozen dough like others use. Way better than pizza nova or pizza pizza.” more", "4.5 star rating"], "76. La Parrilla": ["BarbequeArgentine$$Pine Grove", "Open until 7:30 PM", "“La Parrilla is a small takeout restaurant that's big on flavours! The food is meticulously prepared to order fresh from the grill. What is the meaning of…” more", "4 star rating"], "77. Zafferano Ristorante": ["Italian$$Pine Grove", "“Ive been here twice now and the food doesn't disappoint! It's a popular spot that gets very busy on the weekends. The ambiance is lively, decor is a little…” more", "4 star rating"], "78. Villaggio Ristorante": ["ItalianMediterranean$$$Kleinburg", "Opens in 35 min", "“Take out review: Ordered Caesar salad and fettuccine con funghi. Also got to try the cavatelli con melenzane and the argula salad. The pastas were cooked…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "79. Caffe al Volo": ["CafesKleinburg", "“Great Gelato friendly family run. All the things that make you smile and happy to patronize. A real tiny gelato shop out the side of the restaurant. If the…” more", "4.5 star rating"], "80. Gallo Churrasqueira": ["Portuguese$", "“I will ALWAYS support here! Always for Christmas and gatherings! It's a little rough as it gets crazy in there. You will see staff screaming at each other,…” more", "4 star rating"], "82. The Summerhill": ["Gastropubs$$", "Open until 10:00 PM", "“One of the best local restaurants in Nobleton, super delicious cocktails, food, and friendly staff!! Highly recommend!” more", "Takeout", "2.5 star rating"], "83. Picko Lime": ["Vietnamese$$", "Open until 11:00 PM", "“Their food is actually good. Tasty but not too much or maybe no msg. I didn't have any msg after-effects. House special pho and lemongrass beef are highly…” more", "4 star rating"], "84. Pho Metro": ["Vietnamese$$", "Open until 9:00 PM", "“Delicious pho in Vaughan. The broth isn't cloudy, the price is just right, and the meat is plentyful. It's 18$ for an XL. Honestly can feed two people so…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "85. Mo’ Ramyun": ["NoodlesKorean", "“Tldr: place felt like it was right out of a kdrama. Food was well seasoned, but for my taste buds slightly under seasoned. Ambiance is great, good date spot…” more", "Takeout", "3.5 star rating"], "86. Maker Pizza": ["PizzaChicken WingsSandwiches", "Open until 10:00 PM", "“Don't sleep on Maker's Pizza. I hope and pray this restaurant thrives in Thornhill. Parking: Ample parking in the plaza Ambience: Take out spot, good date…” more", "Delivery", "Takeout", "4 star rating"], "87. Mr Zagros": ["DonairsMediterraneanTurkish$$", "Open until 11:00 PM", "“This location is delicious! Love mr zagros , this location gave so much food in the platter which yes it's expensive but it fed me 3 meals ! Skip the dishes…” more", "Delivery", "4 star rating"], "88. Cafe Louise BakeHouse": ["BakeriesCafes", "Closed until 9:00 AM tomorrow", "“You line up at the counter and order from a menu there. They give you a table number and call or deliver your order to you. There is a large bread factory in…” more", "4 star rating"], "89. The Captain’s Boil": ["Cajun/CreoleSeafoodAsian Fusion$$", "Open until 9:00 PM", "“Ok so.... Captain my Captain, the last time I came in I was discouraged with the response from the management, Food was good but response from management when…” more", "3.5 star rating"], "90. Emily’s Bakery": ["BakeriesDelis$", "Open until 8:00 PM", "“Been here a few times and loved the fresh cooked ready-to-eat food. Their dishes are extra saucey and flavourful, the veggies never too salty/oily, and stews…” more", "3.5 star rating"], "92. Royal Jade": ["HakkaThai$$", "Open until 9:00 PM", "“Found this gem by accident, we were craving for lobster and was disappointed to learn that Wah Sang was closed down. We stumbled upon Royal Jade- and are we…” more", "4.5 star rating"], "93. Kibo Sushi": ["Sushi BarsJapanese", "Open until 10:00 PM", "“Great value for money! We had the lovers boat for three and was pleasantly surprised with 3 miso soups and 3 salads. In addition to great quality assorted…” more", "3.5 star rating"], "94. Locale King City": ["Italian$$", "Opens in 28 min", "“great italian spot if you're not looking to trek downtown. the interior is simple and casual. food all around tasted wonderful and portions sizes are large.…” more", "Delivery", "4 star rating"], "95. Shogi Sushi": ["Sushi BarsJapanese$$", "Open until 11:00 PM", "“Delicious Sushi every time! Have never had a bad experience at Shogi sushi before! It's my favourite sushi place in the area” more", "3.5 star rating"], "96. Dear Saigon": ["Vietnamese", "Open until 8:00 PM", "“Formerly Little Saigon, this has been our go-to place for pho for years now. Very friendly staff and good service but it is the pho that keeps us coming back.…” more", "4 star rating"], "97. El Jefe De Pollo": ["Fast FoodSandwichesChicken Wings", "Open until Midnight", "“Excellent food- great environment! Was greeted at the door by the owner/chef who suggested I try the chef's special - It was fantastic! Just the right amount…” more", "Delivery", "Takeout", "4.5 star rating"], "98. Uptown BBQ": ["PortuguesePine Grove", "“I ordered a chicken meal from UberEats, for delivery. Total price came to $32, including delivery, for a family size meal. This includes an entire rotisserie…” more", "Delivery", "Takeout", "4.5 star rating"], "99. Mama Rosa’s": ["ItalianSandwichesFast Food$$", "Closed today", "“HIDDEN GEM ALERT!!!!! In the middle of an industrial area hidden in an industrial unit lies Parmigiana Sandwiches. Anyone in the Vaughan area knows that…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "100. The Great Maratha": ["Indian", "Open until 9:30 PM", "“Three of us popped in for dinner on a Friday night for a friends birthday. It's easy to miss the restaurant, as it's in a plaza on the west side of Weston Road…” more", "Delivery", "4 star rating"], "102. Greek Brothers": ["Greek$$Pine Grove", "Open until 7:00 PM", "“Great spot in Vaughan for a quick bite. The food is really fresh and the portions are large. Their style reminds of Messini, another great restaurant on…” more", "Takeout", "3.5 star rating"], "103. Osteria Gente": ["ItalianPine Grove", "Opens in 25 min", "“Had a birthday dinner here several days ago and it was amazing ! Service was great! Staff were friendly as always! Food was hot, tasty and delicious!…” more", "5 star rating"], "104. Kebab Istanbul": ["Middle Eastern", "“Friendly service and fresh food prepared to order. My son and I shared the Adana Kebab combo. Everything was delicious. I especially liked the housemade hot…” more", "Delivery", "Takeout", "4.5 star rating"], "105. Rumi’s Restaurant": ["Middle EasternPersian/IranianCaterers", "Open until 9:00 PM", "“High quality and very tasty food. This little restaurant at this small Woodbridge plaza definitely serves one of the most delicious Persian food in Toronto,…” more", "Outdoor seating", "Delivery", "Takeout", "5 star rating"], "106. La Campagna Italian Eatery": ["Italian$$", "Open until 9:00 PM", "“We enjoyed a small family lunch there recently. The food was fresh and cooked to order. The pasta dishes were cooked to perfection and the veal and chicken…” more", "4.5 star rating"], "107. Babushka Club": ["LoungesDance ClubsSeafood$$$$", "Open until 2:00 AM", "“Amazing venue Food is excellent and the service is great. Owners are really nice. I have attended several parties here and I can't wait for the next one.” more", "4 star rating"], "108. Xpress Bbq": ["Portuguese$", "Open until 8:00 PM", "“favourite Portuguese BBQ chicken. Made me wait one time for 3 hours on new Years, but I gave them another chance because the food is 100/100 and I've never…” more", "3.5 star rating"], "109. Fresh Burger": ["BurgersPoutineries$$", "Open until 10:00 PM", "“Fresh Burger is literally just that - the freshest (and best) burger I've ever had! I'm from the USA, but I don't think I've had a better burger than here in…” more", "4 star rating"], "110. Zet’s": ["American (Traditional)GreekBeer BarPine Grove", "Open until 11:00 PM", "“Not authentic Greek but portions are crazy huge & food is pretty good if you're craving \"mr.Greek but better\" type food. Got the chicken souvlaki dinner & the…” more", "4 star rating"], "112. The Lobster Trap": ["SeafoodDessertsCoffee & Tea$$$Pine Grove", "Opens in 21 min", "“Truly the greatest seafood I have ever had!!! They import the lobster directly from Nova Scotia!!! Everything you get will be absolutely scrumptious!! I…” more", "3 star rating"], "113. Gran Gusto Ristorante": ["PizzaItalian$$Pine Grove", "Open until 10:30 PM", "“I first heard of this restaurant through my sister. We were looking for an authentic Italian restaurant to celebrate a birthday and Chinese New Year. It was…” more", "Takeout", "4.5 star rating"], "114. Sushi Wa": ["Sushi BarsJapaneseAsian Fusion$$", "Open until 10:00 PM", "“A cosy Japanese eatery, with freshest ingredients and warm service. The food is delicious. I have been there 2-3 times now, tried new items from the menu every…” more", "Delivery", "Takeout", "4.5 star rating"], "115. Loukoumania Café": ["Cafes", "Open until 10:00 PM", "“Finally got to try these! One phrase to describe these: Timbits but better These are greek puffs with a variety of flavours and toppings to choose from. We…” more", "Delivery", "Takeout", "4 star rating"], "116. Pho Weston": ["Vietnamese$$", "Open until 10:00 PM", "“This place is one of those hole in the wall hidden gems. The place itself isn't in the greatest shape as for what ever reason most phó places aren't. Chairs,…” more", "3.5 star rating"], "117. Iryewon": ["Korean", "Open until 9:00 PM", "“Kam Pung Ki * sweet and spicy pork with veggies * super fresh and crispy Sam Sung Cham Pong * Cham pong but with more noods and toppings * portions is up…” more", "Delivery", "4.5 star rating"], "118. Perla Oyster Bar And Grill": ["SeafoodSteakhousesPine Grove", "Opens in 21 min", "“My dinner last nights!! Tasty food and great service!!! Constantly doing their best.” more", "4.5 star rating"], "119. Shawarma Jwan": ["Middle Eastern", "Open until 11:00 PM", "“This is my favourite spot to go to for shawarma in Vaughan! The food tastes great, and the portions are huge! I typically order the chicken souvlaki plate,…” more", "4.5 star rating"], "120. Church’s Texas Chicken": ["Chicken ShopFast FoodChicken Wings", "Open until 11:00 PM", "“I'd like to advise everyone to try this brand! Widely spreading across the GTA, church's chicken have some pretty delicious stuff on the menu! Their chicken is…” more", "4 star rating"], "122. Sparkly Japanese Thai": ["Sushi BarsAsian FusionJapanese$$", "Open until 11:00 PM", "“A pretty good sushi restaurant! They have both all-you-can-eat and a-la-carte options. We chose a la carte because we wanted some items that were not available…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "123. San Antonio Foods": ["Italian$$", "Open until 6:00 PM", "“By far the best place for a quick, delicious, and satisfying lunch or dinner! My favourite thing on their menu is the spicy lentil soup.” more", "4.5 star rating"], "124. Naan and Kabob": ["Afghan", "“If you love Bamiyan, you'll love this place. Pricing is comparable but offers a better selection of skewers including paneer (with eggplant) skewer and chicken…” more", "5 star rating"], "125. Galina’s BBQ": ["Portuguese$$", "Open until 9:00 PM", "“I went there today for the first time Food was pretty good, Portuguese cuisine is usually very tasty. As I'm Brazilian, I appreciate the good Portuguese food…” more", "Delivery", "Takeout", "4 star rating"], "126. Aldo’s Restaurant Peruvian Food": ["PeruvianBuffets", "Open until 3:00 AM", "“Keep in mind I am Peruvian sooooo... I took my Caucasian friend and she absolutely loved it! But this place does not do Peruvian food justice... but it's…” more", "4 star rating"], "127. Raffaele’s Cantina": ["Italian$$", "Opens in 18 min", "“We had come here for lunch on a Wednesday afternoon at around 12:00 pm. We absolutely LOVED the food! I had ordered the Polenta Fritta ($16.00) to start, while…” more", "3.5 star rating"], "128. Bamiyan Kabob": ["Afghan", "Open until 11:00 PM", "“I was attending a new place for physio and was a bit early so I decided to look around the plaza for a snack. Several doors down saw a sign for Bamiyan Kabob.…” more", "4.5 star rating"], "129. Clementina": ["Breakfast & Brunch", "Closed until 8:00 AM tomorrow", "“OK... I really don't know why this place is getting their breakfast and lunch handed to them ... First of all, the reviews are pretty weird. Half of the…” more", "2.5 star rating"], "130. Halibut House": ["Fish & ChipsBreakfast & BrunchSeafood$$", "Open until 9:00 PM", "“Delicious fish and chips. Had the halibut and chips. Halibut cooked to perfection. Chips fantastic nice thick cut not greasy or over salted but perfect…” more", "4 star rating"], "132. Peppers": ["CaribbeanIndian$", "Open until 11:00 PM", "“Great food! Simple take out but every thing was great. Jerk Chicken & Rice awesome. Sauce very spicy so be careful but still lot of flavour. Service was great” more", "4.5 star rating"], "133. XXI Chophouse": ["Steakhouses$$$Kleinburg", "Open until 2:00 AM", "“Great food and service here! We thoroughly enjoyed the wine, starters and entrees that we ordered! The meal started with freshly baked dinner rolls in a cast…” more", "2.5 star rating"], "134. Scaddabush Italian Kitchen & Bar": ["ItalianBars$$", "Open until 11:30 PM", "“Went out for a team dinner here on a Wednesday night. Very nice ambience and quiet where you can have conversations. Staff was friendly and overall good…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "135. King Of Fish N Chips": ["SeafoodMiddle EasternFish & Chips$", "Open until 7:30 PM", "“Surprised this place actually reopened. They closed for renovation for a very long time I was convinced it was done. Another surprise is that they left the…” more", "Delivery", "Takeout", "4 star rating"], "136. Nove Ristorante": ["ItalianSteakhousesPizza$$Pine Grove", "Opens in 44 min", "“Great food, great service, lovely atmosphere. Hard to stand out in this area, with so many great Italian options, but if our first visit was any indication,…” more", "Delivery", "4 star rating"], "137. T.O.’s Kathi Roll Eatery": ["Asian FusionIndian", "Open until 11:00 PM", "“Food was amazing!!!! One of the few \"indian fusion\" places i tried and it was soo good. The desserts were also amazing!” more", "5 star rating"], "138. Yang’s Teppanyaki & Sushi": ["Japanese$$$", "Open until 10:30 PM", "“Context: I was in Vaughan one day with a friend and was craving sushi so we decided to try this place out since it was near our location. We went during lunch…” more", "Outdoor seating", "Delivery", "Takeout", "3 star rating"], "139. The Salty Dawg": ["Cafes", "“When you initially walk in, it looks like you're entering someone's house. There is someone barbecuing meat outside and making pizzas in an outdoor oven. The…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "140. Punjaabi Grand": ["BuffetsIndianDesserts$$Pine Grove", "Open until 9:45 PM", "“Delicious dishes well prepared and portioned when you dine in. Staff is short hut manageable. Will come back for sure!” more", "Takeout", "4 star rating"], "142. Bosphorus Turkish Cuisine": ["TurkishSaladJuice Bars & Smoothies", "Open until 10:00 PM", "“I've come here on several occasions for dine-in and take out, and I have never been disappointed! I'm a big fan of their pide, their bread is so light and…” more", "4.5 star rating"], "143. Nina’s Tropical Island": ["CaribbeanSoul Food$$", "Open until 8:00 PM", "“Outstanding value, great service, and delicious food! Stumbled into Nina's with a hankering for some jerk. Got curious when I saw their jerk SHAWARMA! They…” more", "4 star rating"], "144. Cucinetta Italian Fast Casual": ["Italian", "Open until 11:00 PM", "“Nice casual dining venue, very friendly staff. Food is well prepared and tasty. You have a good selection of all your typical Italian favourites along with…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "145. Ciao Roma": ["ItalianPizza$$Pine Grove", "Open until 8:00 PM", "“They have a great selection of pizzas, I had a hard time choosing 1. Ordered a full Amitriciana and a half Affumicata. I'm glad I went with the half size as…” more", "4 star rating"], "146. Sampaguita Village": ["Filipino$$", "Open until 8:00 PM", "“I am 1/2 Filipino and wanted to introduce my friend to Filipino food. I had seen this place on Yelp get good reviews, so we came here for lunch one day. It…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "147. Smoke ‘N’ Roti": ["CaribbeanDownsview", "Open until 8:30 PM", "“found this place about a year ago and have been back multiple times since. My go to is the curry goat roti. Every time I've had it it's been perfect! The other…” more", "4.5 star rating"], "148. Stroganoff Restaurant": ["Modern European", "Open until 11:00 PM", "“Great restaurant for Russian / Moldovan / Romanian food. Nice and clean interior with big tables and ample seating. Food is as expected - good selection,…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "149. Smoke’s Poutinerie": ["Poutineries$", "Open until 3:00 AM", "“I'm ashamed to say I've never been to a Smoke's before. I know, I know. But honestly I was a bit wary of them, thinking fast food chain poutine may not be…” more", "Delivery", "Takeout", "3.5 star rating"], "150. Tahini’s": ["Middle EasternMediterranean", "Open until 11:00 PM", "“SO GOOD!! Tahini's is an awesome shawarma/middle eastern spot in Richmond Hill. They have a unique menu which is quite extensive, and when you order you give…” more", "4.5 star rating"], "152. Cafe Landwer - Rutherford & Bathurst": ["CafesBreakfast & BrunchMediterranean$$", "Open until 11:00 PM", "Live wait time: 0 mins", "“We love this place. The food is amazing. The service is perfect. Lanwer is our family's favourite place of course the first choice!” more", "Delivery", "Takeout", "Find a Table", "3.5 star rating"], "153. Earls Kitchen + Bar": ["Canadian (New)Cocktail Bars$$", "Open until Midnight", "“Came here for lunch today and tried out a couple of things. Hostess was friendly and warm at the door and the decor of the restaurant was pretty nice as…” more", "3 star rating"], "154. Maple Sushi": ["Sushi BarsAsian Fusion$$Maple", "Open until 10:00 PM", "“The quality of this AYCE sushi is above average. They have more fried rice & fried noodle options than other places, as well as a few innovative dishes (eg…” more", "Takeout", "3.5 star rating"], "155. King Munchy": ["JapaneseSushi BarsBurgers", "Open until 10:00 PM", "“Loved the innovation! Chicken katsu burger, bulgogi burger, katsu banana? I mean, c'mon!! This is such a hidden gem. So much that it's located INSIDE the Esso…” more", "Delivery", "Takeout", "5 star rating"], "156. Grazie Ristorante": ["Italian$$", "Open until 10:00 PM", "“I went there for Sunday lunch. It was a cozy place, without much decor. The tables were quiet close to each other. I think due to staff shortage, they didn't…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "157. Hogan’s Restaurant": ["Canadian (New)Modern European$$$", "Open until 2:00 AM", "“Never has a bad meal there over the years. Definitely one of York Region's best restaurants. Parking is on the street.” more", "Takeout", "4 star rating"], "158. LIMITLESS Bar & Grill": ["BarbequeSports BarsAsian Fusion", "Open until 2:00 AM", "“Really hidden gem of a bar! The owner and staff are always friendly and not only are the beer nice and cold, it pales in comparison to the food. We got the…” more", "4 star rating"], "159. Churrasqueira Costa Verde": ["Portuguese$$", "Open until 9:00 PM", "“We enjoyed our BBQ chicken, potatoes & rice, not sure what justifies the critical reviews. The order takers were pleasant and set expectations for wait time,…” more", "2.5 star rating"], "160. Chungchun Rice Hotdog": ["KoreanHot Dogs", "Open until 11:00 PM", "“Haven't had a rice dog in a hot minute! I normally visit the North York location but I decided to try out the new one in Vaughan since I was passing by for…” more", "5 star rating"], "162. Misoya Sushi": ["JapaneseSushi Bars$", "Open until 10:00 PM", "“Yikes! Some poor reviews lately. Let's start off by saying I visited late 2016. Service was pretty good when I arrived. As the only customers to this small…” more", "Takeout", "4 star rating"], "163. Los Chicos Vaughan": ["Chicken ShopPeruvian", "Open until 9:00 PM", "“I came across this place since my sister lives in the neighbourhood and it was new, so my boyfriend and I decided to stop by and order take-out. The restaurant…” more", "Outdoor seating", "Delivery", "Takeout", "2 star rating"], "164. Fillis BBQ": ["BarbequeSeafoodSandwiches", "“I serendipitously stumbled across this new restaurant on Dufferin, just north of Rutherford. After ordering from the restaurant twice, the only thing I can say…” more", "4.5 star rating"], "165. Pho Dau Bo Restaurant": ["Vietnamese$", "Open until 11:00 PM", "“Craving Pho as always and was nearby this area, so decided to give this place a try. Came here on a Tuesday around 6pm and the place had a few people dining…” more", "4 star rating"], "166. The Burger’s Priest": ["Burgers$$Pine Grove", "Open until 10:30 PM", "“Great tasting burgers and fries . My new go to for a bacon cheese burger even though it is a little more expensive than at my favourite other fast food…” more", "Delivery", "Takeout", "3.5 star rating"], "167. Mastroroberto Trattoria": ["Italian$$$Pine Grove", "Opens in 4 min", "“Went for dinner with the family and right when we walked in was a warm feeling. Tasteful decor, our waiter Claudio was very helpful and professional, his…” more", "3.5 star rating"], "168. Grill Gate": ["Canadian (New)BurgersSandwiches$$", "Open until 9:00 PM", "“It's one of those places I ordered from during COVID through Uber Eats. Today, I went there physically and was touched by the staff who still served me even…” more", "Delivery", "Takeout", "4.5 star rating"], "169. Maple Garden Chinese Restaurant": ["Chinese$$Maple", "Open until 11:00 PM", "“I have been looking.. nay... searching for an old-school, North-American-style Chinese Food joint that delivers to my house in Vaughan, and have been met with…” more", "4 star rating"], "170. The Corned Beef House": ["SandwichesSaladCoffee & Tea$$Thornhill Woods", "Open until 9:00 PM", "“First, the good news. The Montreal smoked meat sandwich was fantastic, as were the fresh cut fries. My wife loved the schnitzel sandwich. Second, the bad…” more", "4 star rating"], "172. Green Dragon Cafe & Video Game": ["Video Game StoresCafesBarsPine Grove", "Open until Midnight", "“This is a great hangout place. Nice setting to just sit, relax, and have a drink with some friends. They have a wide variety of video games that make this…” more", "5 star rating"], "173. Karahi Boys": ["HalalPakistani", "Open until Midnight", "“Karahi boys was good.. I liked the kebabs and the appetizers. They even had food for kids (chicken fingers and fries) which were great. The restaurant was…” more", "3.5 star rating"], "174. Rapizza": ["SandwichesPizzaIndianPine Grove", "Open until 1:00 AM", "“First time here and I ordered the chicken parm. The sauce was fresh, provolone cheese was great alternative to the mozzarella. This sandwich is a 9 out of 10.…” more", "Delivery", "Takeout", "4 star rating"], "175. SsangKye Braised Chicken House": ["Korean$$", "Open until 11:30 PM", "“Finally got to try the braised chicken here and it did not disappoint! We went for lunch and ordered the cheese braised chicken with red sauce and added side…” more", "4 star rating"], "176. Mimino": ["Modern EuropeanMediterranean", "Open until 11:00 PM", "“Very tasty food, reasonably priced and very nice service. They are great for quick take out as well as dinning in. I have been coming for over a year regularly…” more", "Delivery", "Takeout", "4.5 star rating"], "177. Bistro 7501": ["BistrosItalianBreakfast & Brunch", "Closed today", "“This place is the definition of a hidden gem. Located on the ground floor of a nondescript office building in the suburbs with no outside signage and open only…” more", "5 star rating"], "178. Mezon Latino": ["Latin American", "“This is a Colombian stall in a food court. There's no English on the menu, and the staff don't seem to speak any either, but if you pretend you're in Latin…” more", "4 star rating"], "179. Sarko Georgian Restaurant": ["Pan Asian", "Open until 10:00 PM", "“Authentic Georgian food at very reasonable prices. For the two of us, we ordered Badrijani eggplant appetiser, Gebshalia cheese appetiser, staffed peppers,…” more", "4 star rating"], "180. Vivo Pizza+Pasta": ["PizzaItalian$$", "“The pasta and pizza are both very fresh. Quick turnaround time for pickup orders. The takeout is well packaged, though nothing beats fresh in-restaurant when…” more", "Delivery", "3.5 star rating"], "182. Suliko Restaurant": ["RussianModern European$$", "Open until 11:00 PM", "“Amazing food. I'd never had Georgian cuisine before and was happy I was introduced to it here. Friendly service as well! Also Yelp, it is GEORGIAN cuisine,…” more", "4 star rating"], "183. Terra": ["Canadian (New)Jazz & BluesSeafood$$$$Langstaff", "Open until 11:00 PM", "“Terra is a unique place as there aren't many fine dining places in the north end of Toronto. Upscale restaurant with corresponding menu and service. Food…” more", "Delivery", "4 star rating"], "184. Dong Nai River Restaurant": ["Cambodian$Pine Grove", "“Doesn't look like much from the outside but the Pho is pretty good. We decided to give this place a try as it was the only noticeable pho restaurant in the…” more", "3.5 star rating"], "185. Dante’s Pizzeria": ["PizzaItalianSandwiches$$Thornhill Woods", "Open until 10:00 PM", "“Consistency. That's the word. Been nearly 3 years since we visited due to working elsewhere. Ordered that meatball sub and man oh man was it amazing. Had some…” more", "4 star rating"], "186. Cotolet Premium Cutlet": ["Japanese$$", "Open until 9:00 PM", "“This spot is a true Richmond Hill gem, and perhaps my favourite place to get Katsu! It has a slightly more upscale vibe compared to competitors, as it is clean…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "187. OCHA’s": ["Caribbean", "“This is the BEST caribbean food in the Woodbridge area! The owner Ocha is very friendly and cooks everything with care. The portions sizes and prices are…” more", "4 star rating"], "188. Eagles Nest Golf Club": ["American (Traditional)GolfVenues & Event Spaces$$$$", "Open until 10:00 PM", "“The view, setup is beautiful and breath-taking. The golf club is somewhat overpriced compared to the average rates. Their banquet halls are beautiful, with a…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "189. Goodfellas": ["PizzaItalianBarsPine Grove", "Open until 10:00 PM", "“Excellent food and service. We ordered the calamari which had a light and flavourful batter and the arancini was perfect. For the entrees we had the pizza…” more", "Outdoor seating", "3.5 star rating"], "190. Yumiko Sushi & Poke": ["Sushi BarsPokePine Grove", "Open until 9:45 PM", "“AMAZING AYCE SUSHI IN VAUGHAN! Just opened up so I had to come see how it was. Fish was fresh, fried foods were crispy, everything was DELICIOUS! I recommend…” more", "Outdoor seating", "Delivery", "Takeout", "4.5 star rating"], "192. Aneal’s Taste of the Islands": ["Caribbean$$", "Open until 9:00 PM", "“I've been going to Aneal's Taste of the Islands since the pandemic and now it's an almost weekly takeout treat. I usually get the large jerk chicken and…” more", "Delivery", "Takeout", "4.5 star rating"], "193. Deedar’s Restaurant": ["SeafoodSteakhousesBurgers", "Open until 11:30 PM", "“The best Persian food we've had till Today! Clean, professional and Informative employees. We're accommodating to GLUTEN FREE, and KETO OPTIONS!! Just let them…” more", "4.5 star rating"], "194. La Pizza Shoppe": ["PizzaItalianKleinburg", "Open until 7:00 PM", "“I liked it! I got the NY pepperoni pizza and added mushrooms. They did not skimp on either topping. Crust was crisp but soft, quite light and not super…” more", "4 star rating"], "195. Ann’s Congee": ["Chinese$$", "Open until 11:00 PM", "“Hidden in a small plaza and seems like a typical westernized Chinese food take out, Ann's Congee is a gem of a spot. We ordered the lobster combo and while the…” more", "4 star rating"], "196. Pizza Lab": ["PizzaItalianPine Grove", "Open until 7:30 PM", "“What a great neighbourhood find! We ordered 'Deal 1' which comes with 3 medium stone baked pizzas (your choice of 5 toppings for each pizza!), 4 Nutella…” more", "5 star rating"], "197. Chicko Chicken": ["KoreanChicken WingsAsian Fusion", "Open until 10:00 PM", "“Chicko's chicken was surprisingly fantastic! So glad that KFC craving hit and we didn't feel like visiting our usual spots in the area. Chicko's is located in…” more", "4.5 star rating"], "198. Burger Factory": ["Burgers$$", "Open until Midnight", "“Great burgers Made fresh Seriously good burger with good options. Amazing toppings Incredible French fries Not cheap as it will run you $15-25/ person” more", "Delivery", "3.5 star rating"], "199. Streetside Munchies": ["ChineseIndian", "Open until 10:00 PM", "“Tldr: I've only had the Momo's for now (majority of them). They are super tasty, and worth a shot for sure! All the Momo's are well stuffed and seasoned. You…” more", "5 star rating"], "200. Deer Garden Signatures": ["Chinese$$", "“The food here is super tasty! You can order set dishes like curry rices, drinks, set noodle bowls, sandwiches, and appetizers; but the custom noodle bowl is…” more", "Takeout", "4 star rating"], "202. The Vaughan City Grill": ["Breakfast & BrunchDiners$$", "Closed until 7:00 AM tomorrow", "“Came here for breakfast on a Saturday at 10am. Sat on their patio in the sun and ordered the specials, eggs Benedict with avocado and bacon and my companion…” more", "Delivery", "4 star rating"], "203. Banh Mi Boys": ["Sandwiches", "Closed today", "“Best place to get food on campus. Without a doubt! It was so delightfully easy to order and eat here! There was no line, it wasn't overly loud, and the…” more", "Delivery", "4 star rating"], "204. Garibaldi Mexican Restaurant": ["Mexican", "“Walked in, and immediately felt like I was in Mexico. A Mariachi was catching a late lunch (or early), and all the other customers were Mexican as well. The…” more", "5 star rating"], "205. Motorino": ["PizzaItalian$$", "Open until 11:00 PM", "“I would probably give it 3 1/2 if I could. Went for a family dinner on Friday. Enjoyed the polenta fries, and arancini appetizers. Our appetizers were hit and…” more", "Outdoor seating", "3.5 star rating"], "206. Food Fight Bbq": ["BarbequeAmerican (Traditional)", "Open until 10:00 PM", "“I was in the area last week and figured this was my chance to finally try Food Fight BBQ! I ordered takeout dinner for the family, 4 brisket sandwiches and 1…” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "207. Aura by Cashew & Clive": ["Canadian (New)$$Kleinburg", "Closed until 10:00 AM tomorrow", "“Took advantage of a non-Mother's Day date to enjoy the Aura restaurant in the McMichael gallery in Kleinburg. Wise decision indeed! I had made the reservation…” more", "2.5 star rating"], "208. Sake Sushi": ["Sushi BarsJapanese$$", "“I have a bit of a mixed review. The first time we had Sake we absolutely loved it!!! I've told so many people to try it. The second time the sushi was at…” more", "Delivery", "Takeout", "3.5 star rating"], "209. La Fonte Trattoria": ["Italian$$", "Closed today", "“This is a hidden little gem very close to the Woodbridge Italy! It's set up as a traditional Italian hot table only but the food!!! OMG!! It was all…” more", "5 star rating"], "210. Pho Viet Xpress": ["Vietnamese$$Pine Grove", "Open until 11:00 PM", "“Highly recommend. Not in our usual neck of the woods, but were in the area. SPOTLESS, FRESH and plentiful portions with good quality fresh herbs. Not…” more", "Takeout", "4 star rating"], "212. Kyoto": ["Sushi BarsJapanese$$Pine Grove", "Open until 11:00 PM", "“I ordered sushi from here via one of the delivery apps and was really happy with my order. The prices were really fair and the order was pretty good. Only a…” more", "Delivery", "Takeout", "2.5 star rating"], "213. Pho Mi Viet Hoa": ["Vietnamese$", "Open until Midnight", "“I rarely traverse this side of town (Jane & Finch). I've heard that this area is much better than it used to be, yet the stigma of it being dangerous still…” more", "4 star rating"], "214. Tandoori Time": ["IndianPakistani$$", "“Very good authentic Indian food here. A bit on the pricey side but always fresh and excellent service. Butter chicken is always rich while the rice and Chana's…” more", "Delivery", "Takeout", "3.5 star rating"], "215. The Spice Room": ["IndianBuffets$$", "Open until 10:30 PM", "“Very good Indian food for a fair price. Had Tandoori Chicken, Chicken Korma, and an eggplant dish that wife liked with rice and naan. Only suggestions for…” more", "Delivery", "4 star rating"], "216. The Keg Steakhouse + Bar": ["SteakhousesBarsSeafood$$$", "Open until 1:00 AM", "“OK, so Keg is Keg is Keg. It's a great, classic Canadian steakhouse chain. It behooves on me to score it 5/5 because it's such a crowd-pleaser. The steaks are…” more", "Outdoor seating", "Takeout", "3.5 star rating"], "217. Trimani Ristorante": ["Italian$$$", "Opens in 17 min", "“Awesome Italian place. Nice ambiance, great food. Nice place to host a small gathering.” more", "3.5 star rating"], "218. Trio Restaurant & Lounge": ["Canadian (New)Breakfast & BrunchInternational$$", "Open until Midnight", "“Pleasantly surprised to find that the dishes are authentically Indonesian as opposed to \"inspired\". I'm always on the lookout for really good ethnic food, and…” more", "Outdoor seating", "Takeout", "3.5 star rating"], "219. Island Mix Restaurant & Lounge": ["CaribbeanLounges$$", "Open until 11:00 PM", "“Found this place in the outskirts of Vaughan Mills Mall and it's a welcome change from the abundant Italian and fast-food joints in the area. Being someone…” more", "Outdoor seating", "Takeout", "3.5 star rating"], "220. La Grill": ["MediterraneanLebanese$$", "Open until 10:00 PM", "“I recently had my bridal shower here after being a long time customer. And I couldn't have been happier with how the day went! I've been coming for years here…” more", "4 star rating"], "222. Jollibee": ["Chicken ShopFast Food", "Open until 8:00 PM", "“This place is delicious as 10/10 better then McDonald's fries and I recommend to come here again cause who doesn't love fried chicken and other good food!!” more", "Delivery", "Takeout", "3.5 star rating"], "223. Pho Mi 99": ["VietnameseThai$", "Open until 10:00 PM", "“Been coming here for years I will forever give this place my business Love their bo kho soup !! And shrimp fresh rolls !!” more", "3.5 star rating"], "224. The Bean Sprout": ["Gluten-FreeVegan$$", "Open until 7:00 PM", "“Let me start with this. This is the first competently gluten free Chinese restaurant I have been too! I was not disappointed! I don't give five stars out…” more", "Delivery", "Takeout", "4.5 star rating"], "225. Five Guys": ["Fast FoodBurgers$$", "Open until 10:00 PM", "“I always say \"Yes Please!\" When someone mentions a 'Burger Joint'... I ordered a tripe patty with bacon, cheddar on a lettuce wrap and it was pretty good!…” more", "Outdoor seating", "Delivery", "Takeout", "3.5 star rating"], "226. Krave Indian": ["Indian", "Open until 9:30 PM", "“This was outstanding! I took a couple of my staff there for lunch. I ordered the Maharaja Thali with curry chicken and garlic naan. The chicken was incredibly…” more", "4 star rating"], "227. Szechuan Szechuan": ["Chinese$$", "Open until 11:00 PM", "“Great service and amazing sweet and sour pork. We have been here a couple of times and they never fail to impress.” more", "3 star rating"], "228. Banh Mi Nhu Lan": ["VietnameseSandwiches$", "Open until 7:00 PM", "“This place was my go-to cheap lunch place when i worked around the Jane and Finch area. Recently passed by again so I went to pick up their assorted meat sub.…” more", "4 star rating"], "229. Poke Guys": ["PokeHawaiian$$Edgeley", "Open until 9:00 PM", "“Delicious food! Great service! And so close to home. Smells good just coming into the restaurant.” more", "Outdoor seating", "Delivery", "Takeout", "4 star rating"], "230. Yummy Wok N Bbq House": ["Barbeque$", "“I've been eating from this place for as long as I could remember. I might even say that they sell the best Cantonese BBQ in the city. This is strictly a…” more", "4 star rating"]}